{
  "continue": "Continue",
  "guidance_start_title": "Start ",
  "guidance_page_title": "Guidance",
  "guidances": "Guiances",
  "shopping": "Shopping",
  "tutorial": "Tutorial",
  "mighat": "Mighat",
  "g1_male_momayez_item1": "It is recommended not to cut the hair of the head and beard for one month before entering Ihram.",
  "g1_male_momayez_item2": "circumcision is mandatory",
  "g1_general_item1": "It is disliked (makruh) to use henna before Ihram in such a way that its effect remains during Ihram",
  "g1_female_item1": "She may use medication to delay her monthly period, with a doctor’s consultation.",
  "checked": "Checked",
  "set_mighat": "Set Mighat",
  "g2_male_item1": "Two white, unstitched pieces of cloth (izar and rida)",
  "g2_male_item2": "Special sandals for ihram",
  "g2_female_item1": "Plain, non-adorned regular clothing for ihram",
  "g2_general_item1": "Soap, toothpaste, and shampoo without fragrance",
  "g2_general_item2": "Spray bottle",
  "g2_general_item3": "Prayer books and necessary applications",
  "g3_general_item1": "If a person does not practice taqlid, they should, before traveling, choose a marjaʿ (religious authority) according to the principles stated in jurisprudential books.",
  "g3_general_item2": "It is necessary to learn the correct recitation of prayer and talbiyah before the journey.",
  "g3_general_item3": "Learn the practical rulings of wudu (ablution), ghusl (ritual bath), and prayer.",
  "g3_general_item4": "Learn the rulings regarding the purity of clothing and the body.",
  "g3_general_item5": "Learn the rulings of Umrah according to the fatwas of one’s marjaʿ.",
  "g3_female_item1": "Learn the rulings related to the monthly (menstrual) cycle.",
  "outside_mighat": "I am outside the miqāt",
  "mecca_resident": "I am a resident of Mecca.",
  "jeddah_resident": "I am a resident of Jeddah",
  "mecca_mighat": "My home is located between Mecca and the miqāt",
  "ihram_selector_title": "Where do you enter the state of ihram?",
  "at_mighat": "At the miqāt",
  "before_mighat": "Before the miqāt",
  "boundary_mighat": "Along the boundary between two miqats",
  "mighat_selector_title": "Select your miqāt:",
  "guide": "Guide",
  "miqat_masjid_shajarah": "Masjid al-Shajarah",
  "miqat_juhfah": "Juhfah",
  "miqat_yalamlam": "Yalamlam",
  "miqat_qarn_al_manazil": "Qarn al-Manāzil",
  "miqat_dhat_irq": "Dhāt ‘Irq",
  "mighat_guide_item1": "The miqāt for the people of Madinah and those coming by that route is Dhul-Hulayfah (Masjid al-Shajarah).",
  "mighat_guide_item2": "The miqāt for the people of Syria, Egypt, the Maghreb, and those coming by that route is Juhfah.",
  "mighat_guide_item3": "The miqāt for the people of Ta’if and those coming by that route is Qarn al-Manāzil (al-Sayl al-Kabīr).",
  "mighat_guide_item4": "The miqāt for the people of Yemen and those coming by that route is Yalamlam.",
  "mighat_guide_item5": "The miqāt for the people of Iraq and Najd and those passing by that route is Dhāt ‘Irq.",
  "mecca_mighat_text": "Your miqāt is Adnā al-Ḥill (the nearest point outside the Sacred Precinct), such as Hudaybiyyah, Ji‘rānah, and Tan‘īm (Masjid ‘Ā’ishah).\nThese three places do not have any special distinction; rather, entering into ihrām from any location outside the boundaries of the Haram of Mecca is sufficient.",
  "jeddah_mighat_text": "For him, it is permissible to enter into the state of ihram for Hajj and ‘Umrah from Jeddah itself, without there being any need to make a vow, and it is also not obligatory for him to go to any of the miqats.",
  "between_mecca_mighat_text": "For you, it is permissible to go to Jeddah without entering into ihram, and it is not obligatory to go to the miqat in order to enter into ihram.",
  "before_mighat_title": "Only in two cases may you enter into ihram before the miqat:",
  "vowed_ihram": "Nazr ihram",
  "fom_rajab": "Fear of missing the Rajab ‘Umrah",
  "vow_warning_text": "Attention before making a vow:\nIf you know that after entering into ihram by vow, your journey to the Sacred Precinct (Haram) will coincide with rain, then in that case the vow is not fulfilled (based on obligatory precaution).",
  "solutions": "Solutions",
  "solution_item1": "Arrange your travel in such a way that this problem does not arise.",
  "solution_item2": "Refer to the next most learned religious authority and act according to his ruling.",
  "fomo_text": ""
}