{
  "continue": "جاری رکھیں",
  "guidance_start_title": "سفر کا آغاز",
  "guidance_page_title": "سفر سے پہلے",
  "guidances": "ہدایات",
  "shopping": "خریداری",
  "tutorial": "تعلیم",
  "mighat": "میقات",
  "g1_male_momayez_item1": "مستحب ہے کہ احرام سے ایک ماہ پہلے سر اور داڑھی کے بال کاٹنا چھوڑ دے (اور نہ تراشے)",
  "g1_male_momayez_item2": "ختنه شده ہونا ضروری ہے",
  "g1_general_item1": "احرام سے پہلے  اس طرح سے مہندی لگانا مکروہ ہے کہ اس کا اثر احرام کے وقت باقی رہ جائے",
  "g1_female_item1": "ماہانہ عادت کو مؤخر کرنے کے لیے، ڈاکٹر سے مشورہ کر کے، دواؤں کا استعمال کیا جاسکتا ہے",
  "checked": "",
  "set_mighat": "میقات کا تعین",
  "g2_male_item1": "دو سفید چادریں: ردا اور لنگی، بغیر سِلی ہوئی",
  "g2_male_item2": "احرام کی مخصوص چپل",
  "g2_female_item1": "احرام کے لیے بغیر زینت کا عام لباس ",
  "g2_general_item1": "بغیر خوشبو والا صابن، ٹوتھ پیسٹ اور شیمپو",
  "g2_general_item2": "اسپرے بوتل",
  "g2_general_item3": "دعاؤں کی کتابیں اور ضروری ایپلیکیشنز",
  "g3_general_item1": "تقلید: اگر کوئی شخص تقلید نہ کرتا ہو تو اسے چاہیے کہ سفر سے پہلے فقہی کتابوں میں بیان کردہ اصولوں کے مطابق مرجع کا انتخاب کرے",
  "g3_general_item2": "نماز کی قراءت اور تلبیہ کی تصحیح: ضروری ہے کہ سفر سے پہلے نماز کی قراءت اور تلبیہ کو سیکھا جائے",
  "g3_general_item3": "وضو، غسل اور نماز کے عملی احکام کو سیکھا جائے",
  "g3_general_item4": "لباس اور بدن کی طہارت کے احکام کو سیکھا جائے",
  "g3_general_item5": "عمرہ کے احکام کو اپنے مرجع کے فتووں کے مطابق، سیکھا جائے",
  "g3_female_item1": "ماہانہ عادت کے احکام کو سیکھا جائے",
  "outside_mighat": "میں میقات کے باہر ہوں (مثلاً پاکستان سے آ رہا ہوں) ",
  "mecca_resident": "میں مکّہ میں رہائش پذیر ہوں",
  "jeddah_resident": "میں جدہ میں مقیم ہوں",
  "mecca_mighat": "میرا گھر مکّہ اور میقات کے درمیان واقع ہے",
  "ihram_selector_title": "آپ درج ذیل مقامات پر احرام باندھ سکتے ہیں، اور ان میں سے کسی ایک کا انتخاب کریں:",
  "at_mighat": "",
  "before_mighat": "میقات سے پہلے نذر کے ذریعے، یا عمرۂ رجبیہ کے فوت ہو جانے کے خوف کی وجہ سے",
  "boundary_mighat": "میقات کا محاذی مقام",
  "mighat_selector_title": "اپنا میقات منتخب کریں:",
  "guide": "رہنمائی",
  "miqat_masjid_shajarah": "ذو الحلیفہ (مسجدِ شجره)",
  "miqat_juhfah": "جُحفه",
  "miqat_yalamlam": "یَلَملَم",
  "miqat_qarn_al_manazil": "قَرنُ المنازل",
  "miqat_dhat_irq": "ذاتِ عِرق",
  "mighat_guide_item1": "اہل مدینہ اور اس راستے سے آنے والوں کا میقات ذو الحُلیفہ (مسجد الشجرہ) ہے",
  "mighat_guide_item2": "اہل شام، مصر، مغرب اور اس راستے سے آنے والوں کا میقات جُحفہ ہے",
  "mighat_guide_item3": "اہل طائف اور اس راستے سے آنے والوں کا میقات قرن المنازل (السّیل الکبیر) ہے",
  "mighat_guide_item4": "اہل یمن اور اس راستے سے آنے والوں کا میقات یلملم ہے",
  "mighat_guide_item5": "اہل عراق اور نجد اور اس راستے سے آنے والوں کا میقات ذاتِ عرق ہے",
  "mecca_mighat_text": "آپ کا میقات \"ادنیٰ الحِلّ\" ہے، جیسے حدیبیہ، جعرانہ اور تَنعیم (مسجدِ عائشہ) ان تینوں جگہوں کو کوئی خصوصیت حاصل نہیں ہے؛ بلکہ حرمِ مکہ کی حدود سے باہر کسی بھی جگہ سے احرام باندھنا کافی ہے",
  "jeddah_mighat_text": "آپ کے لیے جدہ ہی سے احرام باندھنا جائز ہے، اور اس کے لیے نذر کی ضرورت نہیں، نیز آپ پر کسی بھی میقات پر جانا واجب نہیں۔",
  "between_mecca_mighat_text": "آپ کے لئے اپنے گھر سے احرام باندھنا جائز ہے، میقات پر جاکر احرام باندھنا لازم نہیں ہے",
  "before_mighat_title": "صرف دو صورتوں میں آپ میقات سے پہلے احرام باندھ سکتے ہیں:",
  "vowed_ihram": "نذر کرکے احرام باندھنا",
  "fom_rajab": "عمرۂ رجبیہ کے فوت ہو جانے کے خوف سے احرام باندھنا",
  "vow_warning_text": "نذر کرنے سے پہلے توجہ فرمائیں: \nاگر آپ کو یقین ہو کہ نذر کے احرام پہننے کے بعد آپ کا سفر سایہ میں یا بارش میں ہوگا، تو اس صورت میں نذر محقق نہیں ہوتی (احتیاطِ واجب کی بنا پر)۔",
  "solutions": "راہ کار:",
  "solution_item1": "اپنے سفر کو اس طرح ترتیب دیں کہ یہ مسئلہ پیش نہ آئے",
  "solution_item2": "اپنے مرجع کے بعد والے اعلم مرجع کی طرف رجوع کیا جائے اور اس کے فتوے کے مطابق عمل کیا جائے",
  "fomo_text": "اگر آپ کو یہ خوف ہے کہ میقات تک احرام باندھنے کا انتظار کریں گے تو ماہ رجب میں احرام نہیں باندھ پائیں گے تو اس صورت میں آپ ماہ رجب میں میقات سے پہلے بغیر نذر کئے کسی بھی جگہ سے  احرام باندھ سکتے ہیں۔",
  "start_umrah_journey": "عمرہ کے سفر کا آغاز",
  "vow_formula": "",
  "nadhr_description": "نذر کا صیغہ زبان سے ادا کرنا لازم ہے، اور اسے دو صورتوں میں پڑھا جا سکتا ہے:",
  "nadhr_method_item1": "",
  "nadhr_method_item2": "",
  "with_place_box_text": "لِلّٰهِ عَلَیَّ أَنْ أُحْرِمَ قَبْلَ الْمِیقَات",
  "without_place_box_text": "لِلّٰهِ عَلَیَّ أَنْ أُحْرِمَ مِنْ --- (مثلاً: لاہور)",
  "nadr_notice_text": "",
  "nadr_fulfilled_text": ""
}