{
  "pre_m1_title": "هدایت قبل از محل احرام",
  "prev_m1_guidance_text": "این کارها قبل از احرام صورت بگیرد شما می‌توانید منزل یا در محل احرام آن را انجام دهید",
  "prev_m1_male_item1": "کوتاه کردن سبیل",
  "prev_m1_general_item1": "نظافت بدن",
  "prev_m1_general_item2": "کوتاه نمودن ناخن‌ها",
  "prev_m1_general_item3": "برطرف کردن موهای زیر بغل و عانه (موی شرمگاه)",
  "prev_m1_mighat_condition_item1": "بهتر است غسل احرام در میقات انجام شود",
  "prev_m1_male_item2": "دو پارچه (ردا و ازار) و دمپایی همراه داشته باشد که روی پا و اطراف مچ پا را نپوشانند",
  "prev_m1_male_item3": "توجه: احرام پس از انجام کردن در میقات موجب کفاره می‌شود، بهتر است که سفر تا میقات را به گونه‌ای تنظیم کند که پس از احرام بستن سفر دریایی پیش نیاید",
  "ip1_title": "هدایات در محل احرام",
  "ip1_general_item1": "1- طهارت (وضو یا غسل) برای احرام شرط نیست؛ بنابراین احرام شخص جنب، حائض و نفساء نیز صحیح است.",
  "ip1_mighat_condition_item1": "البته اگر از داخل مسجدی احرام می‌بندند باید احکام مربوط به مسجد را رعایت کنند.",
  "ip1_mighat_condition_item2": "اما چون احرام از داخل «مسجد شجره» بسته می‌شود، احکام یاد شده مربوط به مسجد رعایت گردد.",
  "ip1_general_item2": "2- برای محرم شدن، پاک بودن لباس و بدن لازم نیست؛ بنابراین انسان در حالى که لباس و بدنش پاک نباشد نیز نیت و تلبیه محرم می‌شود. اما پس از محرم شدن، طهارت لباس احرام شرط است.",
  "ip1_mighat_condition_item3": "یقین رسیدن به میقات لازم است.",
  "ip1_mighat_condition_item4": "احرام قبل از میقات و بعد از میقات صحیح نیست.",
  "ip2_title": "احرام",
  "ip2_recommended_text": "کارهای مستحب پیش از احرام",
  "ip2_recommendation": "مستحبات احرام",
  "ip2_recommend_item1": "نظافت بدن",
  "ip2_recommend_item2": "کوتاه نمودن ناخن ها",
  "ip2_recommend_item3": "برطرف کردن موهای زیر بغل و عانه (موی سر مکروه)",
  "ip2_recommend_male_item1": "کوتاه کردن سبیل",
  "ip2_recommend_male_item2": "غسل کردن",
  "ip2_recommend_female_item1": "غسل کردن (خانم‌ها می‌توانند غسل احرام انجام دهند)",
  "ip2_ghusl_recommend_title": "توجه",
  "ip2_ghusl_recommend_item1": "بعد از غسل و قبل از پوشیدن احرام، اگر حدث اصغر صادر شود یا چیزی بخورد یا چیزی بپوشد که بر مُحرم حرام است، غسل مستحبی را اعاده کند",
  "ip2_ghusl_recommend_item2": "غسل احرام اگر در روز انجام شده، تا آخر شب کفایت می‌کند.",
  "ip2_ghusl_recommend_item3": "غسل احرام اگر در شب انجام داده، تا آخر روز آینده کفایت می‌کند.",
  "ip2_obligatory_text": "واجبات احرام:",
  "ip2_clothing_title": "لباس",
  "ip2_obligatory_item1": "۱- پوشیدن لباس احرام",
  "ip2_obligatory_item2": "۲- نیت کردن و گفتن تلبیه",
  "ip2_clothing_male_item1": "همه لباس‌های دوخته را از بدن بیرون آورده شود و لباس احرام (دو پارچه):\r\nردا و لنگ را پوشیده شود",
  "ip2_clothing_female_item1": "خانم‌ها لباس‌های معمول خود را لباس احرام قرار دهند",
  "ip2_clothing_sub_title": "دعا هنگام پوشیدن احرام:",
  "ip2_clothing_general_item1": "الحمدلله الذی رزقنی ما اواری به عورتی و اودی به فیه فرضی، و اعاننی علیه، و اتقرب فیه الی ما امرنی.",
  "ip2_clothing_general_item2": "الحمدلله الذی قصدته، و توجهت الیه، و وجهی اردت فاسلمی، فهو حسبی، و نعم الوکیل، و ظهری، و ملاذی، و رجائی، و منجای، و ذخری، و عدتی فی شدتی و رخائی",
  "ip6_screen_title": "وضعیتتان چیست؟",
  "ip6_male_janabah_label": "جنب",
  "ip6_male_not_janabah_label": "غیر جنب",
  "ip6_female_janabah_label": "",
  "ip7_text_item1": "مستحب است احرام را بعد از انجام نماز ظهر ببندد. اگر این ممکن نباشد، بعد از هر نماز واجب. اگر این هم ممکن نباشد، بعد از شش رکعت یا دو رکعت نافله ببندد.",
  "ip7_prayer_perform_title": "نحوه انجام نماز نافله:",
  "ip7_prayer_perform_text": "من برای عمره مفرده خودم / نیابتی، نماز احرام را می‌خوانم قربةً الی الله.",
  "ip7_text_item2": "مستحب است که در رکعت اول، سوره حمد و سوره توحید خوانده شود و در رکعت دوم، سوره حمد و سوره کافرون تلاوت گردد.",
  "ip7_text_item3": "بعد از نماز، الحمدلله بگویید و ثنای الهی بجا بیاورید، سپس درود بفرستد.",
  "ip10_q1": "آیا برای غسل دسترسی به آب دارید؟",
  "ip10_q2": "آیا می‌توانید حال عبور از یک مسجد و خروج از آن را در دیگری احرام ببندید؟",
  "ip10_q3": "آیا به آب یا چیزی که بتوان با آن تیمم کرد دسترسی دارید؟",
  "ip10_text_item1": "صبر کنید و غسل انجام دهید",
  "ip10_text_item2": "در صورتی که زمان داخل شدن مسجد می‌باشد تیمم کرده و داخل مسجد بروید و احرام ببندید",
  "ip10_q1_hint": "غسل انجام دهید",
  "ip10_q2_hint": "به همین صورت در حال عبور احرام ببندید",
  "ip8_text_item1": "مستحب است نیت لفظاً گفته شود و مقارن با تلبیه باشد.",
  "ip8_text_item2": "«من برای عمره مفرده/حج تمتع احرام را به نیت قربت به الله می‌بندم.»",
  "ip8_text_item3": "تلبیه: گفتن تلبیه واجب است و تکرار آن مستحب می‌باشد. اگر نمی‌توانید به هر دلیلی بخوانید، از ضبط استفاده کرده و تکرار کنید.",
  "ip8_talbiyah_text_title": "متن تلبیه:",
  "ip8_talbiyah_text": "لبیک اللهم لبیک، لبیک لا شریک لک لبیک\nإن الحمد والنعمة لک والملک، لا شریک لک",
  "ip11_title": "اکنون شما محرم شدید\nو اجتناب از محرمات احرام بر شما واجب است.",
  "ip11_description": "",
  "ip11_note_item1": ""
}