{
  "pre_m1_title": "Guidance before the Miqat:",
  "prev_m1_guidance_text": "These actions should be done before Ihram. You may perform them at home or at the Miqat.",
  "prev_m1_male_item1": "Trimming the mustache",
  "prev_m1_general_item1": "Body hygiene",
  "prev_m1_general_item2": "Trimming the nails",
  "prev_m1_general_item3": "Removing underarm and pubic hair",
  "prev_m1_mighat_condition_item1": "It is preferable to perform the Ihram bath at the Miqat",
  "prev_m1_male_item2": "Have two pieces of cloth (Rida and Izar) and sandals that do not cover the foot or the ankle",
  "prev_m1_male_item3": "Note: Entering Ihram before the Miqat incurs a penalty (kaffarah). It is better to plan the journey to the Miqat so that no sea travel occurs after entering Ihram.",
  "ip1_title": "Guidance at the Ihram",
  "ip1_general_item1": "1-Purity (wudu or ghusl) is not a condition for entering ihram; therefore, the ihram of a person who is in a state of janabah, menstruation, or postnatal bleeding is also valid",
  "ip1_mighat_condition_item1": "However, if one enters ihram inside a mosque, the rulings related to the mosque must be observed.",
  "ip1_mighat_condition_item2": "Since ihram is performed inside Masjid al-Shajarah, the mosque-related rulings must be observed.",
  "ip1_general_item2": "2-For entering ihram, being physically clean (body and clothing) is not required; therefore, a person may make the intention and recite the talbiyah even if their body or clothes are not clean. However, after entering ihram, purity of the ihram clothing becomes a requirement.",
  "ip1_mighat_condition_item3": "Certainty of reaching the miqat is required.",
  "ip1_mighat_condition_item4": "Entering ihram before or after the miqat is not valid.",
  "ip2_title": "Ihram",
  "ip2_recommended_text": "Recommended acts before Ihram",
  "ip2_recommendation": "Ihram Recommendation",
  "ip2_recommend_item1": "Personal hygiene of the body",
  "ip2_recommend_item2": "Trimming the nails",
  "ip2_recommend_item3": "Removing the hair of the armpits and the pubic area (Removing head hair is disliked)",
  "ip2_recommend_male_item1": "Trimming the mustache",
  "ip2_recommend_male_item2": "Performing ghusl (ritual bath)",
  "ip2_recommend_female_item1": "Performing ghusl (women may also perform the ghusl of Ihram)",
  "ip2_obligatory_text": "Obligatory acts of Ihram:",
  "ip2_clothing_title": "Clothing",
  "ip2_obligatory_item1": "1- Wearing the Ihram garments",
  "ip2_obligatory_item2": "2- Making the intention and reciting the Talbiyah",
  "ip2_clothing_male_item1": "All stitched clothing must be removed from the body, and the Ihram garments (two pieces):\r\nthe upper cloth (Rida) and the lower cloth (Izar) should be wor",
  "ip2_clothing_item2": ""
}