{
  "pre_m1_title": "Guidance before the Miqat:",
  "prev_m1_guidance_text": "These actions should be done before Ihram. You may perform them at home or at the Miqat.",
  "prev_m1_male_item1": "Trimming the mustache",
  "prev_m1_general_item1": "Body hygiene",
  "prev_m1_general_item2": "Trimming the nails",
  "prev_m1_general_item3": "Removing underarm and pubic hair",
  "prev_m1_mighat_condition_item1": "It is preferable to perform the Ihram bath at the Miqat",
  "prev_m1_male_item2": "Have two pieces of cloth (Rida and Izar) and sandals that do not cover the foot or the ankle",
  "prev_m1_male_item3": "Note: Entering Ihram before the Miqat incurs a penalty (kaffarah). It is better to plan the journey to the Miqat so that no sea travel occurs after entering Ihram.",
  "ip1_title": "Guidance at the Ihram",
  "ip1_general_item1": "1-Purity (wudu or ghusl) is not a condition for entering ihram; therefore, the ihram of a person who is in a state of janabah, menstruation, or postnatal bleeding is also valid",
  "ip1_mighat_condition_item1": "However, if one enters ihram inside a mosque, the rulings related to the mosque must be observed.",
  "ip1_mighat_condition_item2": "Since ihram is performed inside Masjid al-Shajarah, the mosque-related rulings must be observed.",
  "ip1_general_item2": "2-For entering ihram, being physically clean (body and clothing) is not required; therefore, a person may make the intention and recite the talbiyah even if their body or clothes are not clean. However, after entering ihram, purity of the ihram clothing becomes a requirement.",
  "ip1_mighat_condition_item3": "Certainty of reaching the miqat is required.",
  "ip1_mighat_condition_item4": "Entering ihram before or after the miqat is not valid.",
  "ip2_title": "Ihram",
  "ip2_recommended_text": "Recommended acts before Ihram",
  "ip2_recommendation": "Ihram Recommendation",
  "ip2_recommend_item1": "Personal hygiene of the body",
  "ip2_recommend_item2": "Trimming the nails",
  "ip2_recommend_item3": "Removing the hair of the armpits and the pubic area (Removing head hair is disliked)",
  "ip2_recommend_male_item1": "Trimming the mustache",
  "ip2_recommend_male_item2": "Performing ghusl (ritual bath)",
  "ip2_recommend_female_item1": "Performing ghusl (women may also perform the ghusl of Ihram)",
  "ip2_ghusl_recommend_title": "Attention",
  "ip2_ghusl_recommend_item1": "After performing ghusl (ritual washing) and before putting on the ihram, if a minor ritual impurity occurs, or the person eats something, or wears something that is forbidden for a muhrim (a person in the state of ihram), they should repeat the recommended ghusl.",
  "ip2_ghusl_recommend_item2": "If the ghusl for ihram is performed during the day, it is sufficient until the end of that night.",
  "ip2_ghusl_recommend_item3": "If the ghusl for ihram is performed at night, it is sufficient until the end of the following day.",
  "ip2_obligatory_text": "Obligatory acts of Ihram:",
  "ip2_clothing_title": "Clothing",
  "ip2_obligatory_item1": "1- Wearing the Ihram garments",
  "ip2_obligatory_item2": "2- Making the intention and reciting the Talbiyah",
  "ip2_clothing_male_item1": "All stitched clothing must be removed from the body, and the Ihram garments (two pieces):\r\nthe upper cloth (Rida) and the lower cloth (Izar) should be wor",
  "ip2_clothing_female_item1": "Women should consider their usual clothing as their Ihram garments.",
  "ip2_clothing_sub_title": "Supplication when wearing Ihram:",
  "ip2_clothing_general_item1": "Praise be to Allah who has provided me with that by which I cover my private parts and fulfill my obligation, and who has helped me in it, and through it I seek closeness to what He has commanded me.",
  "ip2_clothing_general_item2": "Praise be to Allah whom I have intended, to whom I have turned, and toward whom I have directed my face. So accept from me. He is sufficient for me and the best disposer of affairs, my support, my refuge, my hope, my savior, my provision, and my preparation in times of hardship and ease.",
  "ip6_screen_title": "What's your status?",
  "ip6_male_janabah_label": "In janābah",
  "ip6_male_not_janabah_label": "Not in janābah",
  "ip6_female_janabah_label": "",
  "ip7_text_item1": "It is recommended to enter into ihram after performing the Dhuhr (noon) prayer. If that is not possible, then after any obligatory prayer. If that is also not possible, then one should enter ihram after performing six rak‘ahs or two rak‘ahs of recommended (nafl) prayer.",
  "ip7_prayer_perform_title": "How to perform the recommended prayer:",
  "ip7_prayer_perform_text": "I perform the prayer of ihram for my own Umrah Mufradah / on behalf of someone else, seeking closeness to Allah.",
  "ip7_text_item2": "It is recommended that in the first rak‘ah, Surah Al-Fatiha and Surah Al-Ikhlas (Tawhid) are recited, and in the second rak‘ah, Surah Al-Fatiha and Surah Al-Kafirun are recited.",
  "ip7_text_item3": "After the prayer, say Alhamdulillah, offer praise to Allah, and then send blessings (salawat).",
  "ip10_q1": "Do you have access to water to perform ghusl (ritual bath)?",
  "ip10_q2": "Are you able to pass through one mosque and exit from another while entering ihram?",
  "ip10_q3": "Do you have access to water or something with which you can perform tayammum (dry ablution)?",
  "ip10_text_item1": "Wait and perform ghusl",
  "ip10_text_item2": "If the time requires entering the mosque, perform tayammum and enter the mosque and enter ihram",
  "ip10_q1_hint": "Perform ghusl",
  "ip10_q2_hint": "enter ihram while passing through in this manner",
  "ip8_text_item1": "It is recommended to state the intention verbally and to do so simultaneously with the talbiyah.",
  "ip8_text_item2": "“I enter into ihram for Umrah Mufradah / Hajj Tamattuʿ with the intention of seeking closeness to Allah.”",
  "ip8_text_item3": "Talbiyah: Saying the talbiyah is obligatory, and repeating it is recommended. If for any reason you are unable to recite it, you may use an audio recording and repeat after it.",
  "ip8_talbiyah_text_title": "Text of the Talbiyah:",
  "ip8_talbiyah_text": "Labbayka Allahumma labbayk, labbayka lā sharīka laka labbayk\nIndeed, all praise, blessings, and sovereignty belong to You; You have no partner.",
  "ip11_title": ""
}