{
  "sp1_title": "Sa‘y (Ritual Walking)",
  "sp1_note": "Please note:\nIt is recommended as a precaution to perform the sa‘y immediately after the tawaf and its prayer, following the adhan. However, it is apparent that delaying it until the night or the following day is permissible.\n\nIn a situation of choice (i.e., without necessity), delaying the sa‘y until the next day is not considered obligatory precaution, but it is better to delay the sa‘y until after the morning (Fajr) prayer.\n\nIf one intentionally delays the sa‘y until the next day, then according to obligatory precaution, one must repeat the tawaf and its prayer.\n\nIt is permissible to perform the tawaf before the morning prayer, then perform the morning prayer, and afterward perform the sa‘y.",
  "sp2_guidelines_before_sai": "Guidance Before Sa‘i",
  "sp2_how_to_perform_sai": "How to Perform Sa‘i",
  "sp2_counting_laps": "Counting the Laps of Sa‘i",
  "sp2_guidance_section_title": "Guidance",
  "sp2_guidance_covering_requirement": "Sa‘i must be performed on the ground floor or basement. Performing Sa‘i on upper floors is invalid.",
  "sp2_guidance_purity_requirement": "Purity (wudu or ghusl) is not required for Sa‘i, though it is recommended.",
  "sp2_guidance_mustahab_not_obligatory": "Sa‘i is not obligatory upon others; if valid, it must be performed personally.",
  "sp2_guidance_women_validity": "The Sa‘i of a menstruating or postpartum woman is valid, and she must perform it herself.",
  "sp2_guidance_body_purity": "Purity of the body from impurities is not required for Sa‘i, though it is recommended.",
  "sp2_guidance_dhikr_recommendation": "It is recommended to engage in the remembrance of Allah and transmitted supplications.",
  "sp2_guidance_wheelchair_rule": "A person may use a wheelchair under normal circumstances if conditions allow; however, performing Sa‘i on foot is more virtuous.",
  "sp2_guidance_proxy_rule": "One who cannot perform Sa‘i even with a wheelchair must appoint a proxy.",
  "sp21_walking_not_required": "Walking is not a condition for Sa‘i; therefore, it is permissible to perform Sa‘i while riding a device such as a wheelchair, provided that the person moves it themselves and is not pushed by someone else, and provided they are able to stop whenever they wish.",
  "sp21_proxy_if_cannot": "One who cannot perform Sa‘i themselves (even with assistance), and no one can perform it on their behalf physically, must appoint a proxy.",
  "sp21_option_walk": "Walking",
  "sp21_option_wheelchair": "Wheelchair and Similar",
  "sp2_option_proxy": "Proxy",
  "sp2_how_sai_section_title": "How to Perform Sa‘i",
  "sp2_how_sai_intention": "Make the intention.",
  "sp2_how_sai_start_safa": "It must begin from Safa.",
  "sp2_how_sai_count_rule": "Sa‘i consists of seven laps (from Safa to Marwah counts as one lap, and from Marwah back to Safa counts as one lap).",
  "sp2_how_sai_complete_distance": "One must cover the entire distance between Safa and Marwah.",
  "sp2_how_sai_mountain_parts": "The steps along the route are included from the beginning of the Safa and Marwah areas; climbing to the very top of the mountain is not obligatory, though it is recommended.",
  "sp2_how_sai_direction_rule": "When going from Safa to Marwah, one must face Marwah; when returning from Marwah to Safa, one must face Safa. However, looking around while performing Sa‘i is permissible.",
  "sp2_how_sai_continuity_rule": "Continuity between laps must be observed; meaning one may rest at Safa or Marwah, but not in a way that causes a long interruption.",
  "sp2_how_sai_invalid_talking": "Sleeping during Sa‘i invalidates it.",
  "sp5_dua_before_sai_title": "Recommended Supplication Before Sa‘i",
  "sp5_intention": "Intention: I perform the Sa‘i of my Umrah Mufradah, seeking closeness to Allah.",
  "sp5_recommended_title": "It is recommended:",
  "sp5_recommended_go_to_safa": "Walk calmly and with dignity until reaching the first marker (the starting point from Safa toward Marwah).",
  "sp5_recommended_dhikr": "Say three times: Allahu Akbar, Alhamdulillah, Subhanallah, La ilaha illallah, and send abundant salawat.",
  "sp5_recommended_continue_walk": "Then continue walking calmly and with dignity until reaching the top of Marwah.",
  "sp5_special_section_title": "Walk calmly and with dignity.",
  "sp5_special_between_markers": "Upon reaching the first marker (beginning of Marwah), increase the pace slightly (harwala), not excessively fast, but with composure and dignity.",
  "sp5_special_resume_walk": "Then resume walking calmly and with dignity.",
  "sp5_start_sai_button": "",
  "sp6_optional_wheelchair_rule": "In a normal (non-compelled) situation (meaning someone capable of performing Sa‘i on foot), using a wheelchair is only permissible if the person controls its movement themselves, without relying on someone pushing it.",
  "sp6_compelled_self_perform_rule": "In a state of necessity, if your duty is to perform Sa‘i yourself, the ability to stop at will is required.",
  "sp6_compelled_proxy_rule": "In a state of necessity, if the duty is for someone else to perform Sa‘i on your behalf, the ability to stop at will is not required.",
  "sp7_proxy_obligation_rule": "One who cannot perform Sa‘i directly nor with assistance, and no one else can physically perform it for them, must appoint a proxy.",
  "sp7_proxy_conditions_title": "Conditions of the Proxy: ",
  "sp7_proxy_condition_example": "",
  "sp7_proxy_completed_button": "Proxy Has Performed It",
  "sp8_notes_list": ""
}