{
  "sp1_title": "Sa‘y (Ritual Walking)",
  "sp1_note": "Please note:\nIt is recommended as a precaution to perform the sa‘y immediately after the tawaf and its prayer, following the adhan. However, it is apparent that delaying it until the night or the following day is permissible.\n\nIn a situation of choice (i.e., without necessity), delaying the sa‘y until the next day is not considered obligatory precaution, but it is better to delay the sa‘y until after the morning (Fajr) prayer.\n\nIf one intentionally delays the sa‘y until the next day, then according to obligatory precaution, one must repeat the tawaf and its prayer.\n\nIt is permissible to perform the tawaf before the morning prayer, then perform the morning prayer, and afterward perform the sa‘y.",
  "sp2_guidelines_before_sai": "Guidance Before Sa‘i",
  "sp2_how_to_perform_sai": "How to Perform Sa‘i",
  "sp2_counting_laps": "Counting the Laps of Sa‘i",
  "sp2_guidance_section_title": "Guidance",
  "sp2_guidance_covering_requirement": "Sa‘i must be performed on the ground floor or basement. Performing Sa‘i on upper floors is invalid.",
  "sp2_guidance_purity_requirement": "Purity (wudu or ghusl) is not required for Sa‘i, though it is recommended.",
  "sp2_guidance_mustahab_not_obligatory": "Sa‘i is not obligatory upon others; if valid, it must be performed personally.",
  "sp2_guidance_women_validity": "The Sa‘i of a menstruating or postpartum woman is valid, and she must perform it herself.",
  "sp2_guidance_body_purity": "Purity of the body from impurities is not required for Sa‘i, though it is recommended.",
  "sp2_guidance_dhikr_recommendation": "It is recommended to engage in the remembrance of Allah and transmitted supplications.",
  "sp2_guidance_wheelchair_rule": "A person may use a wheelchair under normal circumstances if conditions allow; however, performing Sa‘i on foot is more virtuous.",
  "sp2_guidance_proxy_rule": "One who cannot perform Sa‘i even with a wheelchair must appoint a proxy.",
  "sp21_walking_not_required": "Walking is not a condition for Sa‘i; therefore, it is permissible to perform Sa‘i while riding a device such as a wheelchair, provided that the person moves it themselves and is not pushed by someone else, and provided they are able to stop whenever they wish.",
  "sp21_proxy_if_cannot": "One who cannot perform Sa‘i themselves (even with assistance), and no one can perform it on their behalf physically, must appoint a proxy.",
  "sp21_option_walk": "Walking",
  "sp21_option_wheelchair": "Wheelchair and Similar",
  "sp2_option_proxy": "Proxy",
  "sp2_how_sai_section_title": "How to Perform Sa‘i",
  "sp2_how_sai_intention": "Make the intention.",
  "sp2_how_sai_start_safa": "It must begin from Safa.",
  "sp2_how_sai_count_rule": "Sa‘i consists of seven laps (from Safa to Marwah counts as one lap, and from Marwah back to Safa counts as one lap).",
  "sp2_how_sai_complete_distance": "One must cover the entire distance between Safa and Marwah.",
  "sp2_how_sai_mountain_parts": "The steps along the route are included from the beginning of the Safa and Marwah areas; climbing to the very top of the mountain is not obligatory, though it is recommended.",
  "sp2_how_sai_direction_rule": "When going from Safa to Marwah, one must face Marwah; when returning from Marwah to Safa, one must face Safa. However, looking around while performing Sa‘i is permissible.",
  "sp2_how_sai_continuity_rule": "Continuity between laps must be observed; meaning one may rest at Safa or Marwah, but not in a way that causes a long interruption.",
  "sp2_how_sai_invalid_talking": "Sleeping during Sa‘i invalidates it.",
  "sp5_dua_before_sai_title": "Recommended Supplication Before Sa‘i",
  "sp5_intention": "Intention: I perform the Sa‘i of my Umrah Mufradah, seeking closeness to Allah.",
  "sp5_recommended_title": "It is recommended:",
  "sp5_recommended_go_to_safa": "Walk calmly and with dignity until reaching the first marker (the starting point from Safa toward Marwah).",
  "sp5_recommended_dhikr": "Say three times: Allahu Akbar, Alhamdulillah, Subhanallah, La ilaha illallah, and send abundant salawat.",
  "sp5_recommended_continue_walk": "Then continue walking calmly and with dignity until reaching the top of Marwah.",
  "sp5_special_section_title": "Walk calmly and with dignity.",
  "sp5_special_between_markers": "Upon reaching the first marker (beginning of Marwah), increase the pace slightly (harwala), not excessively fast, but with composure and dignity.",
  "sp5_special_resume_walk": "Then resume walking calmly and with dignity.",
  "sp5_start_sai_button": "",
  "sp5_harwala_item1": "با آرامش و وقار راه برود تا به محل مناره اول (مقام آغاز هروله) برسد.",
  "sp6_optional_wheelchair_rule": "In a normal (non-compelled) situation (meaning someone capable of performing Sa‘i on foot), using a wheelchair is only permissible if the person controls its movement themselves, without relying on someone pushing it.",
  "sp6_compelled_self_perform_rule": "In a state of necessity, if your duty is to perform Sa‘i yourself, the ability to stop at will is required.",
  "sp6_compelled_proxy_rule": "In a state of necessity, if the duty is for someone else to perform Sa‘i on your behalf, the ability to stop at will is not required.",
  "sp7_proxy_obligation_rule": "One who cannot perform Sa‘i directly nor with assistance, and no one else can physically perform it for them, must appoint a proxy.",
  "sp7_proxy_conditions_title": "Conditions of the Proxy: ",
  "sp7_proxy_condition_example": "",
  "sp7_proxy_completed_button": "Proxy Has Performed It",
  "sp8_intro_instruction": "When one ascends Safa, they should look toward the Ka‘bah, turn toward the corner in which the Black Stone is located, praise and glorify Allah, and remember His blessings.",
  "sp8_notes_list": "1. Say seven times: “Allāhu Akbar” (God is the Greatest).\n\n2. Say seven times: “Al-ḥamdu liLlāh” (All praise is for God).\n\n3. Say seven times: “Subḥān Allāh” (Glory be to God).\n\n4. Say three times:\nThere is no god except Allah alone, without partner. To Him belongs all sovereignty and all praise. He gives life and causes death. He is Living and does not die, and He has power over all things.\n\n5. Then send blessings upon Muhammad and the family of Muhammad.\n\n6. Say three times:\nGod is the Greatest. Praise be to God for guiding us. Praise be to God for what He has granted us. Praise be to God, the Ever-Living, the Sustainer. Praise be to God who never dies.\n\n7. Say three times:\nI bear witness that there is no god except Allah alone, without partner — the One, the Unique, the Self-Sufficient. He has not taken a spouse nor a child. He neither begets nor is born, and there is none comparable to Him. I worship God, devoting the religion sincerely to Him, even if the polytheists dislike it.\n\n8. Say three times:\nO Allah, I ask You for pardon, well-being, and certainty in this world and the Hereafter.\n\n9. Say three times:\nOur Lord, grant us goodness in this world and goodness in the Hereafter, and protect us from the punishment of the Fire.\n\n10. Say three hundred times: “Allāhu Akbar” (God is the Greatest).\n\n11. Say one hundred times: “Lā ilāha illa Allāh” (There is no god except Allah).\n\n12. Say one hundred times: “Al-ḥamdu liLlāh” (All praise is for God).\n\n13. Say one hundred times: “Subḥān Allāh” (Glory be to God).\n\n14. Then say:\nThere is no god except Allah alone, alone. He fulfilled His promise, supported His servant, and alone defeated the confederates. To Him belongs all sovereignty and all praise.\n\n15. Say:\nO Allah, bless me in death and in the grave, and forgive me. O Allah, I seek refuge in You from the darkness and loneliness of the grave. O Allah, shade me under the shade of Your Throne on the Day when there is no shade except Your shade.\n\n16. If you have a need, entrust your supplication to God and say:\nO Most Merciful of the merciful, whose trusts are never lost, protect me in myself and in my family. O Allah, make me independent through Your Book and the Sunnah of Your Prophet, cause me to die upon his religion, and protect me from trials.\n\n17. Say three times: “Allāhu Akbar.”\n\n18. Again send blessings upon Muhammad and the family of Muhammad, then make your personal supplication. If you cannot perform everything, do as much as you are able.\n\n19. And if one departs from there, it is reported that whoever desires abundant wealth and provision should prolong the standing at Ṣafā."
}