{
  "sp1_title": "سعی",
  "sp1_note": "توجه داشته باشید:\nاحتیاط مستحب است که بین اذان، طواف و نماز آن، بلافاصله سعی انجام دهد، هرچند ظاهر این است که تأخیر آن تا شب یا روز دیگر جایز باشد.\n\nدر حال اختیار، به تأخیر انداختن سعی تا روز بعد بنابر احتیاط واجب نیست، اما بهتر است سعی را بعد از نماز صبح به تأخیر اندازد.\n\nاگر سعی را عمداً تا روز بعد به تأخیر اندازد، بنا بر احتیاط واجب باید طواف و نماز آن را دوباره انجام دهد.\n\nجایز است طواف را پیش از نماز صبح انجام دهد، سپس نماز صبح را بخواند و بعد از آن سعی را به‌جا آورد.",
  "sp2_guidelines_before_sai": "هدایت قبل از سعی",
  "sp2_how_to_perform_sai": "نحوه انجام سعی",
  "sp2_counting_laps": "شمارش اشواط سعی",
  "sp2_guidance_section_title": "هدایت",
  "sp2_guidance_covering_requirement": "سعی باید در همکف یا زیرزمین صورت بگیرد. سعی در طبقات بالا باطل است.",
  "sp2_guidance_purity_requirement": "برای سعی طهارت (وضو یا غسل) لازم نیست، البته مستحب است.",
  "sp2_guidance_mustahab_not_obligatory": "سعی منجب نیست، صحیح است باید خودش انجام دهد.",
  "sp2_guidance_women_validity": "سعی حائضه و نفساء صحیح است، باید خودش انجام دهد.",
  "sp2_guidance_body_purity": "برای سعی طهارت بدن از نجاست لازم نیست، البته مستحب است.",
  "sp2_guidance_dhikr_recommendation": "مستحب است انسان به ذکر الله و ادعیه مأثوره مشغول باشد.",
  "sp2_guidance_wheelchair_rule": "شخص در حالت اختیاری می‌تواند با شرایط از ویلچر استفاده کند، با این حال پیاده انجام دادن سعی افضل است.",
  "sp2_guidance_proxy_rule": "کسی که نمی‌تواند حتی با ویلچر سعی کند، وظیفه او نایب گرفتن است.",
  "sp21_walking_not_required": "در سعی، پیاده بودن شرط نیست؛ بنابراین جایز است سعی را در حال سواری وسیله‌ای مانند ویلچر انجام دهد، به شرط آنکه خود او را حرکت دهد، نه اینکه دیگری او را حرکت دهد؛ به شرط آنکه خود او بتواند هرگاه بخواهد بایستد (و حرکت را متوقف کند).",
  "sp21_proxy_if_cannot": "کسی که نمی‌تواند خودش سعی کند (با کمک دیگری) و کسی دیگر هم نمی‌تواند او را سعی دهد، وظیفه او نایب گرفتن است.",
  "sp21_option_walk": "پیاده",
  "sp21_option_wheelchair": "ویلچر و مانند آن",
  "sp2_option_proxy": "نیابت",
  "sp2_how_sai_section_title": "نحوه انجام سعی",
  "sp2_how_sai_intention": "نیت کند",
  "sp2_how_sai_start_safa": "آغازش از صفا باشد",
  "sp2_how_sai_count_rule": "سعی رفتن هفت مرتبه است (از صفا به مروه یک شوط و نیز از مروه تا صفا یک شوط حساب می‌شود).",
  "sp2_how_sai_complete_distance": "باید تمام فاصله میان صفا و مروه را بپیماید.",
  "sp2_how_sai_mountain_parts": "پله‌هایی که در مسیر رفت‌وبرگشت، از ابتدای قسمت صفا و مروه سعی آغاز شده، البته بالای آن قسمت کوه واجب نیست، ولی مستحب است که بر فراز آن برود.",
  "sp2_how_sai_direction_rule": "هنگام رفتن از صفا به مروه باید رو به سوی مروه باشد، و هنگام بازگشت از مروه به صفا بدن رو به سوی صفا باشد؛ اما لازم نیست در حال سعی کردن از اطراف نگاه کردن جایز است.",
  "sp2_how_sai_continuity_rule": "باید بین شوط‌ها (رفت‌وبرگشت‌ها) موالات را رعایت کند؛ یعنی در بین آن دو، استراحت در صفا و مروه به‌گونه‌ای که فاصله طولانی ایجاد نشود.",
  "sp2_how_sai_invalid_talking": "خوابیدن هنگام سعی، سعی را باطل می‌کند.",
  "sp5_dua_before_sai_title": "دعا مستحب قبل از سعی",
  "sp5_intention": "نیت: من سعی عمره مفرده‌ام را انجام می‌دهم، قربتاً الی الله",
  "sp5_recommended_title": "مستحب است:",
  "sp5_recommended_go_to_safa": "با آرامش و وقار راه برود تا به محل مناره اول (صفا آغاز مروه) برسد.",
  "sp5_recommended_dhikr": "و سه مرتبه بگوید: الله اکبر، الحمد لله، سبحان الله، لا اله الا الله، و بسیار صلوات بفرستد.",
  "sp5_recommended_continue_walk": "سپس با وقار و آرامش راه برود تا بالای مروه قرار گیرد.",
  "sp5_special_section_title": "با آرامش و وقار راه رود",
  "sp5_special_between_markers": "هنگام رسیدن به محل مناره اول (محل آغاز مروه)، قدری سریع‌تر حرکت کند (هروله)، نه به گونه‌ای بسیار شدید بلکه با آرامش و وقار.",
  "sp5_special_resume_walk": "سپس با وقار و آرامش راه برود.",
  "sp5_start_sai_button": "آغاز سعی",
  "sp5_harwala_item1": "با آرامش و وقار راه برود تا به محل مناره اول (مقام آغاز هروله) برسد.",
  "sp5_harwala_item2": "پس تا مناره دوم (مقام انتهای هروله) قدری سعی تندتر و هروله کند، نه به گونه‌ای بسیار شدید، بلکه با آرامش و وقار، و ذکر خدا را بخواند و اظهار نیاز به پیشگاه او نماید.",
  "sp5_harwala_item3": "سپس با وقار و آرامش راه برود تا بالای مروه قرار گیرد.",
  "sp5_start_label": "",
  "sp6_optional_wheelchair_rule": "در حالت اختیار (یعنی کسی که قادر بر سعی پیاده است) ویلچر فقط در صورتی جایز است که بتواند آن را در اختیار حرکت‌کننده باشد، بدون اینکه از هل‌دهنده آن را طلب کند.",
  "sp6_compelled_self_perform_rule": "در حالت اضطرار اگر وظیفه شما سعی بنفسه است، اختیار توقف شرط است.",
  "sp6_compelled_proxy_rule": "در حالت اضطرار اگر وظیفه این باشد که دیگری سعی دهد، اختیار توقف شرط ندارد.",
  "sp7_proxy_obligation_rule": "کسی که نمی‌تواند مباشرتاً و نه مساعدتاً سعی کند و فرد دیگری هم نمی‌تواند او را سعی دهد، وظیفه او نایب گرفتن است.",
  "sp7_proxy_conditions_title": "شرایط نایب:",
  "sp7_proxy_condition_example": "",
  "sp7_proxy_completed_button": "ناءب انجام داد",
  "sp8_intro_instruction": "و وقتی بر صفا بالا رفت، به کعبه نگاه کند و به طرف رکن که حجرالاسود در آن است متوجه شود، و خدای را حمد و ثنا گوید و نعمت‌های الهی را به یاد آورد.",
  "sp8_notes_list": "۱. هفت بار بگو: «الله اکبر».\n\n۲. هفت بار بگو: «الحمدلله».\n\n۳. هفت بار بگو: «سبحان‌الله».\n\n۴. سه بار بگو:\nمعبودی جز خداوند یگانه نیست، او شریکی ندارد؛ فرمانروایی و ستایش از آنِ اوست؛ زنده می‌کند و می‌میراند؛ او زنده‌ای است که هرگز نمی‌میرد و بر هر چیزی تواناست.\n\n۵. سپس بر محمد و خاندان محمد صلوات بفرست.\n\n۶. سه بار بگو:\nخدا بزرگ‌تر است؛ سپاس خدا را بر آنچه ما را هدایت کرد؛ سپاس خدا را بر آنچه به ما عطا کرد؛ سپاس خدای زنده و پاینده را؛ سپاس خدایی را که نمی‌میرد.\n\n۷. سه بار بگو:\nگواهی می‌دهم که معبودی جز خدای یگانه نیست، شریکی ندارد؛ خدایی یکتا و بی‌نیاز؛ نه همسری گرفته و نه فرزندی دارد؛ نه زاده شده و نه زاییده، و هیچ‌کس همتای او نیست؛ او را می‌پرستم در حالی که دین را خالصانه برای او قرار داده‌ام، هرچند مشرکان ناخوش داشته باشند.\n\n۸. سه بار بگو:\nخدایا از تو بخشش، سلامتی و یقین در دنیا و آخرت می‌خواهم.\n\n۹. سه بار بگو:\nخدایا در دنیا به ما نیکی عطا کن و در آخرت نیز نیکی، و ما را از عذاب آتش حفظ فرما.\n\n۱۰. سیصد بار بگو: «الله اکبر».\n\n۱۱. صد بار بگو: «لا إله إلا الله».\n\n۱۲. صد بار بگو: «الحمدلله».\n\n۱۳. صد بار بگو: «سبحان‌الله».\n\n۱۴. سپس بگو:\nمعبودی جز خداوند یگانه نیست؛ یگانه و بی‌همتا؛ وعده‌اش را تحقق بخشید، بنده‌اش را یاری کرد و به تنهایی بر گروه‌ها پیروز شد؛ فرمانروایی و ستایش از آنِ اوست.\n\n۱۵. بگو:\nخدایا در مرگ و در قبر بر من برکت قرار بده و مرا بیامرز؛ خدایا از تاریکی و وحشت قبر به تو پناه می‌برم؛ خدایا مرا در سایه عرش خودت پناه ده در روزی که سایه‌ای جز سایه تو نیست.\n\n۱۶. اگر حاجتی داری، دعایت را به خدا بسپار و بگو:\nای مهربان‌ترین مهربانان، که امانت‌هایش تباه نمی‌شود، مرا در جان و خانواده‌ام حفظ کن؛ خدایا مرا به کتابت و سنت پیامبرت بی‌نیاز کن و بر آیین او بمیران و از فتنه حفظم فرما.\n\n۱۷. سه بار بگو: «الله اکبر».\n\n۱۸. دوباره بر محمد و خاندان محمد صلوات بفرست، سپس دعای خود را بخوان؛ و اگر نتوانستی همه اعمال را انجام دهی، به اندازه توانت انجام بده.\n\n۱۹. و اگر از آنجا بازگردی، در روایات آمده است که اگر کسی خواهان مال و روزی فراوان باشد، وقوف در صفا را بیشتر کند"
}