{
  "tmain_p1_title": "طواف",
  "tmain_p1_item1": "هدایات قبل از طواف",
  "tmain_p1_item2": "چک لیست",
  "tmain_p1_item3": "نحوه انجام طواف",
  "tmain_p1_item4": "شمارش اشواط طواف",
  "tmain_p1_confirm": "طواف انجام دادم",
  "np0_title": "نماز طواف",
  "tawaf_guidance_item1": "برای طواف طهارت از حدث اصغر و اکبر، همچنین طهارت بدن و لباس از خبث شرط است.",
  "tawaf_guidance_item2": "پوشاندن عورت در حال طواف به همان حدودی که در نماز معتبر است، بنا بر احتیاط واجب شرط است، و اولی بلکه بنا بر احتیاط رعایت کردن تمام شرایط لباس نمازگزار در پوشش هنگام طواف، بلکه در همه لباس‌های طواف‌کننده است.",
  "tawaf_guidance_male_item1": "خَتنه برای مرد و صبی ممیز شرط است",
  "tawaf_guidance_item3": "طبقه بالایی اگر از بنای کعبه معظم بلندتر باشد، طواف از آن طبقه جایز نیست.",
  "tawaf_guidance_item4": "نماز طواف باید فوراً بعد از طواف خوانده شود لذا کسانی که نمی‌توانند خودشان نماز انجام دهند باید نایب داشته باشند تا موالات عرفی فوت نشود.",
  "trmain_p3_text": "در طواف سازوکار جهان باید تستی شود.\nهدایت، طواف را اختیار دارد و حال سوار بر وسیله‌ای مانند ویلچر انجام دهد (چه خودش آن را براند و چه دیگران آن را حرکت دهند) یا خودش آن‌گونه که می‌تواند یا بخواهد (بدون درخواست از راننده، آن را متوقف کند).\n\nکسی که نمی‌تواند خودش طواف کند (حتی با کمک دیگری) و کسی دیگر هم نمی‌تواند او را طواف دهد، وظیفه او نائب گرفتن است.",
  "select_tawaf_method": "نحوه طواف را انتخاب کنید:",
  "tawaf_method_onfoot": "پیاده",
  "tawaf_method_wheelchair": "ویلچر و مانند آن",
  "tawaf_method_proxy": "نایب",
  "tmain_p4_title": "نحوه انجام طواف",
  "tmain_p4_text_item1": "آغاز طواف از حجر اسود می‌باشد و اختتام هم در حجر اسود است.",
  "tmain_p4_text_item2": "طواف هفت شوط می‌باشد (هر شوط از حجر اسود شروع می‌شود و به حجر اسود ختم می‌شود).",
  "tmain_p4_text_item3": "هفت شوط طواف متوالی محسوب می‌شوند.",
  "tmain_p4_text_item4": "برای اینکه طواف متوالی باشد نباید فاصله زیادی بین شوط‌ها باشد که عرفاً گفته شود طواف پی‌درپی انجام نشده است.",
  "tmain_p4_text_item5": "در بین طواف اختیاراً نباید از حجر اسود فاصله بگیرد، پس اگر در بین طواف اختیاراً از حجر اسود فاصله بگیرد، طواف باطل می‌شود، اما اگر بدون اختیار باشد، طواف باطل نمی‌شود.",
  "tmain_p4_text_item6": "شخص طواف‌کننده می‌تواند برای انجام نماز طواف از مسیر طواف خارج شود و اگر نماز را در غیر مسیر طواف انجام دهد، بعد از نماز باید به همان جایی که از طواف خارج شده بود برگردد و از همان‌جا طواف را ادامه دهد.",
  "tmain_p4_text_item7": "واجب است طواف‌کننده در تمام حالات طواف، کعبه در سمت چپ خود قرار دهد.",
  "tmain_p4_text_item8": "طواف‌کننده برای بوسیدن حجر اسود می‌تواند از مسیر دیگری وارد شود و بعد از انجام آن به مسیر طواف برگردد.",
  "tmain_p4_text_item9": "زن حائض یا نفساء در حال طواف، حرکت خود را به صورت مستقیم ادامه دهد.",
  "tmain_p4_text_item10": "حجر اسماعیل در داخل طواف محسوب نمی‌شود.",
  "tmain_p4_text_item11": "طواف‌کننده باید بیرون حجر حجر طواف کند، نه از داخل حجره و نه روی دیوار.",
  "tmain_p4_text_item12": "طواف کننده باید طواف را بیرون باشد و از پله‌ها و از پله‌ای که در اطراف آن قرار دارد و روی شاذروان انجام نشود.",
  "tmain_p5_title": "آغاز طواف",
  "tmain_p5_intention_title": "نیت:",
  "tmain_p5_intention_text": "من طواف عمره مفرده را انجام می‌دهم، قربةً الی‌الله",
  "tmain_p5_notice_text": "طواف قبل از شروط چهارم وضو از بین برده طواف باطل می‌شود\nبعد از اتمام شروط چهارم وضو از بین برده اشکالی ندارد",
  "tmain_p5_more_info": "اطلاعات بیشتر",
  "tmail_p6_title": "شمارش اشواط",
  "tmail_p6_text_item1": "وضو با غسل از بین رفت",
  "tmail_p6_text_item2": "نجس شدن لباس یا بدن تا عامدانه نباشد هنگام طواف",
  "tmail_p6_text_item3": "ستر عورت از بین رفت",
  "tmail_p6_text_item4": "بخشی از زیبایی‌های زن – مانند مو – ظاهر شد",
  "tmail_p6_text_item5": "شکایت",
  "tmain_p6_q1": "آیا توانایی برطرف کردن نجاست را بدون برهم زدن مسیر می‌تواند انجام دهد؟\nحتی اگر مجبور باشد لباس را تعویض کند یا لباسی پاک بپوشد؟",
  "tmain_p6_q1_hint": "پس از برطرف کردن نجاست طواف کامل کند",
  "tmain_p6_q2": "در صورت ناممکن بودن، با علم به نجاست یا طواف نجاست قبل از اتمام شوط رابع بوده؟",
  "tmain_p6_q2_hint1": "طواف را تمام کند و نیازی به اعاده آن نیست",
  "tmain_p6_q2_hint2": "یعنی نجاست بعد از شوط رابع بوده، طواف را تمام کند و نیازی به اعاده آن نیست",
  "tmain_p10_title": "احکام بطلان وضو هنگام طواف",
  "tmain_p8_male_text": "اگر عورت مرد آشکار شد . لازم است بنا بر احتیاط واجب  آن مقدار از طواف را که در حتال برهنه شدن واقع شده است جبران کند",
  "tmain_p8_female_text": "بخشی از بدن زن که پوشنادن آن واجب است . به طور قهری یا از روی سهو آشکار شد طواف باطل نمیشود مگر آن مقداری که بدون رعایت شرایط انجام شده است پس اگر آن مقدار یک شوط یا بیشتر باشد آن شوط باطل میشود و باید دوباره انجام شود . و اگر بخشی از یک شوط باشد باید بزرگردد و همان مقدار را که در آن پوشش را رعایت نکرده بود جبران کند و اگر به سبب شدت ازدحام نتواند بازگردد میتواند بدون قصد طاف تا حچر السود راه برود سپس از آن شوط را از سر بگیرد ",
  "tmain_p9_text": "‫طواف‬‫ صحیح‬ ‫است‬",
  "tmain_p9_warning": "‫اما ‬‫موھای‬ ‫بود‬ ‫را‬ ‫بپوشاند‬",
  "tmain_p10_q1": "وضوی شما از بین رفته است؟",
  "tmain_p10_q1_option1": "بعد از اتمام شوط چهارم",
  "tmain_p10_q1_option2": "قبل از اتمام شوط چهارم",
  "tmain_p10_q1_hint": "طواف باطل است بعد از تجدید طهارت طواف را از نوع شروع کنید. اگر شخص جنب باشد واچب است فورا مسجد را ترک کند.",
  "tmain_p10_q2": "آیا شکستن طهارت قبلی با اختیار بوده؟",
  "tmain_p10_q2_hint1": "اگر موالات از بین رفته، طواف را از نو شروع کند. اگر شخص جنب باشد، واجب است فوراً مسجد را ترک کند.",
  "tmain_p10_q2_hint2": "اگر شخص به جهت جنابت، طواف را قطع کرده، تجدید طهارت کند و از همان جا که قطع کرده بود، طواف را ادامه دهد، طواف صحیح است، اما اگر طواف را از اول شروع کند، واجب است فوراً مسجد را ترک کند.",
  "tmain_p17_title": "طواف به پایان رسید",
  "tmain_p17_text1": "احتیاط واجب آن است که پس از طواف بیدرنگ\nنماز طواف خوانده شود؛ به این معنا که از نظر عرفی\nبین طواف و نماز فاصله‌ای ایجاد نشود.",
  "tmain_p17_text2": "و ظاهر این است که فاصله‌ای کوتاه، مانند ده دقیقه\nبرای استراحت یا یافتن جای بهتر و مناسب‌تر برای\nنماز و مانند این امور، با «مبادرت عرفی» منافاتی\nندارد.",
  "tmain_p17_text3": "همچنین او حق ندارد که قبل از نماز یک عمل\nمستقل دیگری مثلا نماز قضا یا نماز طواف نیابتی\nانجام دهد",
  "tmain_p18_title": "نیابت",
  "tmain_p18_text1": "کسی که نه می‌تواند مستقیم و نه مساعده\nطواف کند و نیز کسی دیگر هم نمی‌تواند\nاز طرف او طواف دهد، وظیفه او نائب گرفتن است",
  "tmain_p19_title": "ویلچر و مانند آن",
  "tmain_p19_usecase_text1": "موارد استفاده از ویلچر:",
  "tmain_p19_usecase1": "اختیاری",
  "tmain_p19_usecase2": "اضطراری",
  "tmain_p19_q": "",
  "np0_text1": "برای نماز باید پشت مقام ابراهیم برود\nاحتیاط واجب آن است که پس از طواف بیدرنگ\nنماز طواف خوانده شود؛ به این معنا که از نظر عرفی\nبین طواف و نماز فاصله‌ای ایجاد نشود.",
  "np0_text2": "و ظاهر این است که فاصله‌ای کوتاه، مانند ده دقیقه\nبرای استراحت یا یافتن جای بهتر و مناسب‌تر برای\nنماز و مانند این امور، با «مبادرت عرفی» منافاتی\nندارد.",
  "np0_text3": "فاصله برای درک وقت فضیلت نماز واجب مشکل\nندارد\nفاصله برای شرکت در نماز جماعت مشکل ندارد\nفاصله برای ضرورت مانند تجدید طهارت مشکل\nندارد",
  "np0_text4": "همچنین او حق ندارد که قبل از نماز یک عمل\nمستقل دیگری مثلا نماز قضا یا نماز طواف نیابتی\nانجام دهد",
  "np0_q": "آیا قادر بر انجام نماز طواف هستید ولو با کمک\nدیگری؟",
  "np9_title": "نائب",
  "np9_text1": "وظیفه شما نائب گرفتن است",
  "np9_text2": "کسی می تواند نائب بگیرد که بدلیل بیماری شکستگی یا مانند آن، حتی با کمک دیگران نیز توانایی انجام مستقیم آن را ندارد",
  "np9_q": "آیا نائب با رعایت موالات عرفی نماز طواف را انجام\nداد؟",
  "np10_title": "حکم مسئله",
  "np10_text": "احتیاط واجب آن است که طواف را دوباره انجام دهد\nسپس برای نماز نائب بگیرد"
}