{
  "tmain_p1_title": "Tawaf",
  "tmain_p1_item1": "Instructions before Tawaf",
  "tmain_p1_item2": "Checklist",
  "tmain_p1_item3": "How to perform Tawaf",
  "tmain_p1_item4": "Counting the circuits (rounds) of Tawaf",
  "tmain_p1_confirm": "Done",
  "tawaf_guidance_item1": "For performing Tawaf, purity from both minor and major ritual impurity is required, as well as the cleanliness of the body and clothing from physical impurity (najāsah).",
  "tawaf_guidance_item2": "Covering the private parts during Tawaf is required—based on obligatory precaution—within the same limits that are required for prayer. Moreover, it is preferable, and rather based on precaution, to observe all the conditions of a prayer performer’s clothing during Tawaf, in fact for all garments worn by the person performing Tawaf.",
  "tawaf_guidance_male_item1": "Circumcision for Men and Discerning Boys Is a Condition",
  "tawaf_guidance_item3": "If the upper level (floor) is higher than the structure of the Sacred Kaaba, performing Tawaf from that level is not valid.",
  "tawaf_guidance_item4": "The Tawaf prayer must be performed immediately after Tawaf. Therefore, those who are unable to perform the prayer themselves must appoint a representative (proxy) so that customary continuity (muwālāt ‘urfī) is not lost.",
  "trmain_p3_text": "In Tawaf, the mechanism of the system must be tested.\nGuidance has the discretion, and Tawaf may be performed while riding a means such as a wheelchair—whether the person moves it themselves or someone else moves it—or the person may move in whatever way they can or wish (without asking the driver to stop it).\n\nA person who cannot perform Tawaf themselves (even with help from another), and no one else can perform Tawaf on their behalf, must appoint a proxy (Na'ib).",
  "select_tawaf_method": "Choose the method of Tawaf:",
  "tawaf_method_onfoot": "On foot",
  "tawaf_method_wheelchair": "Wheelchair and similar",
  "tawaf_method_proxy": "Proxy (Na'ib)",
  "tmain_p4_title": "How to Perform Tawaf",
  "tmain_p4_text_item1": "Tawaf begins at the Black Stone (Hajar al-Aswad) and also ends at the Black Stone.",
  "tmain_p4_text_item2": "Tawaf consists of seven rounds (each round starts from the Black Stone and ends at the Black Stone).",
  "tmain_p4_text_item3": "The seven rounds are considered continuous.",
  "tmain_p4_text_item4": "For Tawaf to be considered continuous, there should not be long gaps between the rounds such that it would no longer be commonly regarded as consecutive.",
  "tmain_p4_text_item5": "During Tawaf, one must not intentionally move away from the Black Stone; if one does so intentionally, the Tawaf becomes invalid. However, if it happens unintentionally, the Tawaf is not invalid.",
  "tmain_p4_text_item6": "A person performing Tawaf may leave the Tawaf path to perform the Tawaf prayer. If the prayer is performed outside the Tawaf path, after finishing the prayer, the person must return to the exact point where they left off and continue the Tawaf from there.",
  "tmain_p4_text_item7": "It is obligatory that during all states of Tawaf, the Kaaba remains on the left side of the person performing Tawaf.",
  "tmain_p4_text_item8": "To kiss the Black Stone, the pilgrim may enter from another path, and after doing so, return to the Tawaf path.",
  "tmain_p4_text_item9": "A woman who is menstruating (ha’id) or in post-partum bleeding (nifas), if in the state of Tawaf, should continue her movement in a straight manner.",
  "tmain_p4_text_item10": "Hijr Ismail is not considered part of the Tawaf area.",
  "tmain_p4_text_item11": "The pilgrim must perform Tawaf outside the Hijr, not inside it and not on its wall.",
  "tmain_p4_text_item12": "Tawaf must be performed on the ground level outside the structure, and not on the stairs or on the raised base (Shadharwan) surrounding the Kaaba.",
  "tmain_p5_title": "Beginning of Tawaf",
  "tmain_p5_intention_title": "Intention (Niyyah):",
  "tmain_p5_intention_text": "I perform the Tawaf of Umrah Mufradah, seeking closeness to Allah.",
  "tmain_p5_notice_text": "If Tawaf is performed before completing the fourth condition, and ablution (wudu) is invalidated, the Tawaf becomes invalid.\nHowever, if ablution is invalidated after completing the fourth condition, there is no problem.",
  "tmain_p5_more_info": "More Info",
  "tmail_p6_title": "Counting the Rounds",
  "tmail_p6_text_item1": "Ablution (wudu) is invalidated by ghusl",
  "tmail_p6_text_item2": "Clothing or body becomes impure, as long as it is not intentional, during Tawaf",
  "tmail_p6_text_item3": "Covering of the private parts is lost",
  "tmail_p6_text_item4": "Part of a woman’s adornment — such as hair — becomes visible",
  "tmail_p6_text_item5": "Doubt",
  "tmain_p6_q1": "Is the person able to remove the impurity without disrupting the Tawaf path,\neven if it requires changing clothes or wearing clean clothing?",
  "tmain_p6_q1_hint": "after removing the impurity, complete the Tawaf.",
  "tmain_p6_q2": "(If it is not possible, and the person knows about the impurity, or the impurity occurred before completing the fourth round:)?",
  "tmain_p6_q2_hint1": "Complete the Tawaf, and there is no need to repeat it.",
  "tmain_p6_q2_hint2": "meaning the impurity occurred after the fourth round",
  "tmain_p10_title": "Rulings on the Invalidity of Ablution (Wudu) During Tawaf",
  "tmain_p8_male_text": "",
  "tmain_p8_female_text": "",
  "tmain_p9_text": "",
  "tmain_p9_warning": "",
  "tmain_p10_q1": "When did your ablution (wudu) become invalid?",
  "tmain_p10_q1_option1": "After completing the fourth round",
  "tmain_p10_q1_option2": "Before completing the fourth round",
  "tmain_p10_q1_hint": "abc",
  "tmain_p13_doubt1": "Doubt accompanied by conjecture regarding the number of circuits (shawts)",
  "tmain_p13_doubt2": "Doubt about ritual purity during tawaf",
  "tmain_p13_doubt3": "Doubt about the loss of customary continuity (muwālāt ʿurfīyah)",
  "tmain_p13_doubt1_text1": "Doubt between the 7th and 8th circuit:",
  "tmain_p13_doubt1_text2": "",
  "tmain_p13_doubt1_text3": "In the following doubts, the tawaf is invalid as an obligatory precaution:",
  "tmain_p13_doubt1_text4": "Doubt between 3 and 4\nDoubt between 3 and 5\nDoubt between 3 and 6\nDoubt between 3 and 7\nDoubt between 4 and 5\nDoubt between 4 and 6\nDoubt between 4 and 7\nDoubt between 5 and 6\nDoubt between 5 and 7\nDoubt between 6 and 7",
  "tmain_p13_doubt1_q1": "Do you have certainty about prior purity?",
  "tmain_p13_doubt1_q1_hint": "Ignore your doubt",
  "tmain_p13_doubt1_q2": "Did the doubt occur before completing the fourth circuit?",
  "tmain_p13_doubt1_q2_hint_yes": "Renew your wudu and restart the tawaf from the beginning.",
  "tmain_p13_doubt1_q2_hint2_no": "Renew ritual purity and continue the tawaf from that point until completion.",
  "tmain_p13_doubt3_text1": "It is obligatory to perform the tawaf again from the beginning.",
  "tmain_p10_q2": "Was the breaking of the previous state of purity done voluntarily?",
  "tmain_p10_q2_hint1": "",
  "tmain_p10_q2_hint2": "",
  "tmain_p17_title": "The tawaf has been complete",
  "tmain_p17_text1": "As an obligatory precaution, after completing the tawaf, the tawaf prayer must be performed immediately—that is, according to common custom, no gap should occur between the tawaf and the prayer.",
  "tmain_p17_text2": "It appears that a short interval, such as ten minutes, for resting or for finding a better and more suitable place for the prayer, and similar matters, does not conflict with “customary immediacy.”",
  "tmain_p17_text3": "Likewise, one does not have the right to perform another independent act before the prayer—for example, a make-up (qadāʾ) prayer or a tawaf prayer performed on behalf of someone else (proxy tawaf prayer).",
  "tmain_p18_title": "Proxy (Niyābah)",
  "tmain_p18_text1": "A person who cannot perform the tawaf directly, nor with assistance, and for whom no one else is able to perform the tawaf on their behalf, has the duty to appoint a proxy.",
  "tmain_p18_proxy_conditions": "Conditions of the proxy:",
  "tmain_p18_proxy_c1": "The proxy must be adult, sane, a believer, and capable of performing the act.",
  "tmain_p18_proxy_c2": "Certainty must be obtained that the proxy will carry out the act.",
  "tmain_p18_proxy_c3": "Merely informing the proxy, as an obligatory precaution, is not sufficient.",
  "tmain_p18_proxy_c4": "A woman may act as proxy for a man, and a man may act as proxy for a woman.",
  "tmain_p18_proxy_c5": "Justice (ʿadālah) is not a شرط for the proxy.",
  "tmain_p18_proxy_c6": "The proxy does not need to be in a state of ihram.",
  "tmain_p18_confirm_label": "The proxy has performed it",
  "tmain_p18_modal1_text1": "",
  "tmain_p18_modal1_text2": "",
  "tmain_p18_modal1_text3": "",
  "tmain_p18_modal1_q": "",
  "tmain_p18_modal2_text1": "",
  "tmain_p18_modal2_q": "",
  "tmain_p19_title": "Wheelchair and similar means",
  "tmain_p19_usecase_text1": "Situations in which a wheelchair may be used:",
  "tmain_p19_usecase1": "Optional",
  "tmain_p19_usecase2": "Necessary (emergency)",
  "tmain_p19_q1": "Do you have the ability to perform the tawaf yourself?",
  "np0_title": "Tawaf Prayer",
  "np0_text1": "To perform the prayer, one should go behind the Station of Abraham (Maqām Ibrāhīm).\nAs an obligatory precaution, after completing the tawaf, the tawaf prayer should be performed immediately—meaning that, according to common custom, no interval should be created between the tawaf and the prayer.",
  "np0_text2": "It appears that a short interval, such as ten minutes, for resting or for finding a better and more suitable place for the prayer, and similar matters, does not conflict with “customary immediacy”.",
  "np0_text3": "A delay in order to catch the preferred (virtuous) time of an obligatory prayer is not a problem.\nA delay in order to participate in congregational prayer is not a problem.\nA delay due to necessity—such as renewing ritual purity (e.g., wudu)—is not a problem.",
  "np0_text4": "Also, one is not permitted to perform another independent act before this prayer—for example, a make-up (qadāʾ) prayer or a tawaf prayer performed on behalf of someone else (niyābat).",
  "np0_q": "Are you able to perform the tawaf prayer, even with someone else’s help?",
  "np1_text": "After completing Tawaf, has a gap that invalidates customary continuity (muwalat ‘urfi) occurred?",
  "np2_title": "Interval between Tawaf and Tawaf Prayer",
  "np2_intentional_delay": "Intentional delay between Tawaf and Tawaf Prayer",
  "np2_excusable_ignorance": "Was excusably ignorant",
  "np2_forgetful": "Was forgetful",
  "np2_compelled": "Was compelled (e.g., due to crowding or renewing ablution)",
  "np2_other_cases": "Other cases",
  "np4_title": "Ruling of the Issue",
  "np4_ruling_text": "As an obligatory precaution, one must repeat the Tawaf and then perform the prayer.",
  "np5_title": "Was intentional",
  "np5_description": "Deliberately creating a delay between Tawaf and the prayer. The criterion in this issue is common custom (‘urf) — any duration that is عرفاً considered a separation, even if very short or as little as one step.",
  "np6_title": "Other Cases",
  "np6_case_congregational_prayer": "Attending congregational prayer in Masjid al-Haram",
  "np6_case_time_of_virtue": "To attain the preferred (virtuous) time of the obligatory prayer",
  "np6_case_forced_upper_level": "Was compelled to perform Tawaf on the upper level, and descending to the courtyard to perform the Tawaf prayer near Maqam would cause the loss of the required continuity (muwalat).",
  "np7_title": "Attaining the Preferred Time of Prayer",
  "np7_description": "",
  "np8_question": "If at the bottom of the Aqibdareh / Ibrahimi steps, can one find a place for prayer?",
  "np8_question_hint_yes": "one must come down unless the customary continuity (muwalat) would be lost.",
  "np8_question_hint_no": "If there is no place (and congregational prayer is being held upstairs), one may pray there, provided it is not considered as being behind Maqam Ibrahim, even if it is far from it.",
  "np9_title": "Proxy (Na'ib)",
  "np9_text1": "Your duty is to appoint a proxy.",
  "np9_text2": "A person may appoint a proxy if, due to illness, a fracture, or similar reasons, they do not have the ability to perform it directly, even with the help of others.",
  "np9_q": "Did the proxy perform the tawaf prayer while observing customary continuity?",
  "np10_title": "Ruling of the issue",
  "np10_text": "As an obligatory precaution, the tawaf must be performed again, and then a proxy should be appointed to perform the prayer.",
  "tpm1_item1": "",
  "tpm1_female_item1": "I have purity from major ritual impurity\n(after purification from menstruation, postnatal bleeding, major and medium istiḥāḍah, janābah, and touching a corpse)",
  "tpm1_item2": "I have purity from minor ritual impurity",
  "tpm1_item3": "I have purity of the body from najāsah\nEven blood less than the size of a dirham is not excused",
  "tpm1_item4": "",
  "tpm1_item5": "I have purity of clothing from najāsah",
  "tpm1_item6": "",
  "tpm1_item7": "I have covered the parts of the body whose covering is required in prayer",
  "tpm2_title": "Purity from major ritual impurity (hadath al-akbar)",
  "tpm2_q1": "Are you able to perform ghusl?",
  "tpm2_q1_hint_yes": "Perform ghusl and then perform tawaf.",
  "tpm2_q2": "Are you unable to perform ghusl and have no hope of being able to perform it?",
  "tpm2_q2_hint_no": "Wait until the excuse is removed.",
  "tpm2_q3": "Is tayammum possible?",
  "tpm2_q3_hint_yes": "",
  "tpm2_q3_hint_no": "",
  "tpm2_confirm": "Purity has been achieved",
  "tpm3_title": "Purity from minor ritual impurity (hadath al-asghar)",
  "tpm3_status": "Status:",
  "tpm3_status_healthy": "Healthy",
  "tpm3_status_excused": "Excused",
  "tpm3_status_healthy_hint": "",
  "tpm3_status_healthy_hint2": "",
  "tpm4_title": "Unable due to an excuse",
  "tpm4_q1": "If you cannot perform wudu due to an excuse, is this excuse accompanied by hopelessness (no expectation of recovery)?",
  "tpm4_q1_hint_no": "",
  "tpm5_title": "Excused Person (Maʿdhūr)",
  "tpm5_text1": "An excused person includes someone injured (specific case to be determined),\na person with incontinence (maslūl), and one suffering from continuous discharge (mabṭūn).\n\nTheir duty: Excused-state purification (ṭahārah ʿudhrīyah).",
  "tpm5_text2": "",
  "tpm5_text2_modal": "Waiting for an opportunity is obligatory, and delaying it is not required, whether the opportunity arises in the middle of the time or at its end.\n\nYes, if he is waiting until the end of the time and an opportunity arises during that period, and he performs his prayer at that time, then his tawaf is valid provided that he has acted according to his duty (even if he committed a sin by delaying).",
  "tpm5_text3": "",
  "tpm5_text3_modal": "He performs wudu — or ghusl, or tayammum — according to his obligation and suffices with it.\nThen he performs the tawaf and suffices with performing it and exits from it, whether he faints before the tawaf or during it.\n\nLikewise, he remains in a state of purity unless something occurs from him other than the condition with which he is afflicted, or that same condition intensifies, provided that it is not attributable to illness — even if there is complete recovery.",
  "tpm5_text4": "",
  "tpm5_text4_modal": "",
  "tpm5_text5": "",
  "tpm5_text5_modal": "It is not obligatory to delay it until the situation becomes clear.\nHowever, if he hastens and performs it, and later it becomes clear that there was sufficient opportunity, then as an obligatory precaution he must perform it again.",
  "tpm5_text6": "",
  "tpm5_text6_modal": "If he hastens (three circuits of tawaf) and performs them, and later it becomes clear that there was sufficient opportunity, then as an obligatory precaution he must perform it again.",
  "tpm5_modal_general_text": "For a person suffering from chronic diarrhea (mabṭūn), the recommended precaution—indeed, according to the apparent implication of the issue, a necessary precaution—is that if he is able, he should combine between two actions:\n\nHe should both perform the tawaf himself along with its two rakʿahs of prayer, and also appoint a proxy to perform them on his behalf.\n\nIf his excuse is removed after performing the tawaf with excused purification (ṭahārah ʿudhrīyah), and before the time for tawaf ends, repeating the tawaf with normal (optional) purification is not obligatory.",
  "tpm6_title": "",
  "tpm6_general_text1": "",
  "tpm6_general_text2": "",
  "tpm6_male_text": "If a man’s ʿawrah (private area) becomes exposed during tawaf, then as a necessary precaution, he must compensate (repeat) the portion of tawaf that was performed while it was exposed.",
  "tpm6_female_momayez_text": "As a precaution, one must observe the limits of covering required in prayer; therefore, apart from the head, neck, hands, and feet, the rest of the body must be covered.",
  "tpm6_female_text1": "For the validity of a woman’s tawaf, covering the feet is not required; however, since they may be seen by non-mahram men, covering them is obligatory.",
  "tpm6_female_text2": "The appearance of some of a woman’s adornment—such as a small amount of hair during tawaf—does not invalidate the tawaf. However, the validity of her tawaf is problematic if her forearms, or all or most of her hair, are exposed—even if this occurs out of ignorance.",
  "tpm6_female_text3": "Not covering the face, as an obligatory precaution, is required for the validity of tawaf (meaning that covering the face is not permitted). If it occurs due to excusable ignorance, the tawaf is not invalidated.",
  "tpm6_female_text4": "If a part of a woman’s body that must be covered becomes uncovered during tawaf—even involuntarily, such as her covering slipping—and even one complete circuit (shawt) or more is performed in that state, the tawaf is not invalidated; because the portion performed without proper covering is not counted.",
  "tpm6_female_text5": "If she is able to correct it without returning, she must omit that circuit and perform it again; and if only part of a circuit was affected, she must return and make up that portion which was performed without proper covering. If, due to crowding, returning is not possible, she may walk—without the intention of tawaf—until reaching the Black Stone (Hajar al-Aswad), and then begin that circuit anew.",
  "tpm6_female_text6": "If, during tawaf, some of a woman’s adornment becomes visible, this does not harm the validity of her tawaf.",
  "tpm6_confirm_text": "Covering (satr) has been achieved",
  "tpm7_title": "",
  "tpm7_text1": "Tawaf performed with impurity (najasah) on the body or clothing is not valid. Even blood less than the size of a dirham—which is excused in prayer—is not excused in tawaf according to obligatory precaution.\n\nLikewise, impurity that is excused in prayer (in clothing or covering that is not a condition for tawaf) is not excused in tawaf.\n\nHowever, carrying a najis (ritually impure) object during tawaf is permissible in all cases.\n\nAlso, carrying something that is intrinsically impure (ʿayn al-najasah) is allowed; likewise carrying the skin of an animal whose meat is not lawful, and carrying a child who is impure and upon whom actual impurity exists—all of this does not invalidate tawaf.",
  "tpm7_q1": "Are you compelled (in a state of necessity) to perform tawaf with impurity on your body or clothing?",
  "tpm7_q1_hint_yes": "It is permissible (no problem).",
  "tpm7_q2": "What is the impurity?",
  "tpm7_q2_option1": "Blood from wounds or injuries prior to healing",
  "tpm7_q2_option2": "Other than that",
  "tpm7_q2_option2_hint": "It is obligatory (as an obligatory precaution) to remove the impurity.",
  "tpm7_q3": "Is purifying or changing it excessively difficult (causes hardship)?",
  "tpm7_q3_hint_yes": "It is permissible (no problem).",
  "tpm7_q3_hint_no": "It is obligatory (as an obligatory precaution) to remove the impurity.",
  "tpm8_title": "Checklist",
  "tpm8_text1": "Circumcision is not required for a non-discerning child (ṣabī ghayr mumayyiz) whose guardian performs tawaf on his behalf; rather, it is recommended as a precaution.",
  "tpm8_warning1": "However, for a non-discerning child who performs tawaf himself, circumcision is required (the full ruling should be completed via inquiry/istiftā’).",
  "tpm8_text2": "Circumcision is obligatory; the tawaf of an uncircumcised person is not valid.",
  "tpm8_warning2": "If circumcision is not possible, the ruling should be obtained from Mr. Haider.",
  "tpm8_submit_text": "Circumcision completed",
  "tpm8_status1": "Adult male",
  "tpm8_status2": "Discerning child (mumayyiz)",
  "tpm8_status3": "Non-discerning child",
  "tpf2_title": "Type of Hadath",
  "tpf2_text1": "Janabah (major ritual impurity) or touching a dead body",
  "tpf2_text2": "I became pure from menstruation (hayd) or postpartum bleeding (nifas) but have not performed ghusl",
  "tpf2_text3": "I currently have menstruation or postpartum bleeding",
  "tpf2_text4": "Medium Istihada",
  "tpf2_text5": "Heavy Istihada",
  "tpf4_title": "Heavy Istihada",
  "tpf4_q1_blood_flowing": "Are you continuously bleeding? (Meaning: the blood flows continuously and does not stop, soaking the cotton placed there.)",
  "tpf4_q2_minor_hadath": "Are you in a state of minor impurity (hadath asghar)?",
  "tpf5_title": "Medium Istihada",
  "tpf5_text": "“Perform one ghusl for Tawaf and the prayer of Tawaf.\nAfter that, perform wudu for Tawaf.\n(For the prayer of Tawaf, another wudu is required.)”",
  "tpf6_title": "Type of Hadath",
  "tpf6_text1": "Minor Istihada (light irregular bleeding)",
  "tpf6_text2": "Other than minor Istihada (for example: falling asleep, etc.)",
  "tpf7_title": "Rulings",
  "tpf7_text1": "“You must perform a separate wudu (ablution) for Tawaf and the prayer of Tawaf, based on obligatory precaution.",
  "tpf7_text2": "I am unable to perform wudu due to an excuse.",
  "np13_title": "How to Perform the Prayer",
  "np13_intention": "Make the intention: 'I perform the Tawaf prayer of my Umrah Mufradah, seeking closeness to Allah.'",
  "np13_two_rakats": "It consists of two rak‘ahs like the Fajr prayer.",
  "np13_recommended_recitation": "It is recommended to recite Surah Al-Tawhid in the first rak‘ah after Al-Fatihah, and Surah Al-Kafirun in the second rak‘ah after Al-Fatihah.",
  "np13_loud_or_silent": ""
}