{
  "tmain_p1_title": "طواف",
  "tmain_p1_item1": "هدایات قبل از طواف",
  "tmain_p1_item2": "چک لیست",
  "tmain_p1_item3": "نحوه انجام طواف",
  "tmain_p1_item4": "شمارش اشواط طواف",
  "tmain_p1_confirm": "طواف انجام دادم",
  "np0_title": "نماز طواف",
  "tawaf_guidance_item1": "برای طواف طهارت از حدث اصغر و اکبر، همچنین طهارت بدن و لباس از خبث شرط است.",
  "tawaf_guidance_item2": "پوشاندن عورت در حال طواف به همان حدودی که در نماز معتبر است، بنا بر احتیاط واجب شرط است، و اولی بلکه بنا بر احتیاط رعایت کردن تمام شرایط لباس نمازگزار در پوشش هنگام طواف، بلکه در همه لباس‌های طواف‌کننده است.",
  "tawaf_guidance_male_item1": "خَتنه برای مرد و صبی ممیز شرط است",
  "tawaf_guidance_item3": "طبقه بالایی اگر از بنای کعبه معظم بلندتر باشد، طواف از آن طبقه جایز نیست.",
  "tawaf_guidance_item4": "نماز طواف باید فوراً بعد از طواف خوانده شود لذا کسانی که نمی‌توانند خودشان نماز انجام دهند باید نایب داشته باشند تا موالات عرفی فوت نشود.",
  "trmain_p3_text": "در طواف سازوکار جهان باید تستی شود.\nهدایت، طواف را اختیار دارد و حال سوار بر وسیله‌ای مانند ویلچر انجام دهد (چه خودش آن را براند و چه دیگران آن را حرکت دهند) یا خودش آن‌گونه که می‌تواند یا بخواهد (بدون درخواست از راننده، آن را متوقف کند).\n\nکسی که نمی‌تواند خودش طواف کند (حتی با کمک دیگری) و کسی دیگر هم نمی‌تواند او را طواف دهد، وظیفه او نائب گرفتن است.",
  "select_tawaf_method": "نحوه طواف را انتخاب کنید:",
  "tawaf_method_onfoot": "پیاده",
  "tawaf_method_wheelchair": "ویلچر و مانند آن",
  "tawaf_method_proxy": "نایب",
  "tmain_p4_title": "نحوه انجام طواف",
  "tmain_p4_text_item1": "آغاز طواف از حجر اسود می‌باشد و اختتام هم در حجر اسود است.",
  "tmain_p4_text_item2": "طواف هفت شوط می‌باشد (هر شوط از حجر اسود شروع می‌شود و به حجر اسود ختم می‌شود).",
  "tmain_p4_text_item3": "هفت شوط طواف متوالی محسوب می‌شوند.",
  "tmain_p4_text_item4": "برای اینکه طواف متوالی باشد نباید فاصله زیادی بین شوط‌ها باشد که عرفاً گفته شود طواف پی‌درپی انجام نشده است.",
  "tmain_p4_text_item5": "در بین طواف اختیاراً نباید از حجر اسود فاصله بگیرد، پس اگر در بین طواف اختیاراً از حجر اسود فاصله بگیرد، طواف باطل می‌شود، اما اگر بدون اختیار باشد، طواف باطل نمی‌شود.",
  "tmain_p4_text_item6": "شخص طواف‌کننده می‌تواند برای انجام نماز طواف از مسیر طواف خارج شود و اگر نماز را در غیر مسیر طواف انجام دهد، بعد از نماز باید به همان جایی که از طواف خارج شده بود برگردد و از همان‌جا طواف را ادامه دهد.",
  "tmain_p4_text_item7": "واجب است طواف‌کننده در تمام حالات طواف، کعبه در سمت چپ خود قرار دهد.",
  "tmain_p4_text_item8": "طواف‌کننده برای بوسیدن حجر اسود می‌تواند از مسیر دیگری وارد شود و بعد از انجام آن به مسیر طواف برگردد.",
  "tmain_p4_text_item9": "زن حائض یا نفساء در حال طواف، حرکت خود را به صورت مستقیم ادامه دهد.",
  "tmain_p4_text_item10": "حجر اسماعیل در داخل طواف محسوب نمی‌شود.",
  "tmain_p4_text_item11": "طواف‌کننده باید بیرون حجر حجر طواف کند، نه از داخل حجره و نه روی دیوار.",
  "tmain_p4_text_item12": "طواف کننده باید طواف را بیرون باشد و از پله‌ها و از پله‌ای که در اطراف آن قرار دارد و روی شاذروان انجام نشود.",
  "tmain_p5_title": "آغاز طواف",
  "tmain_p5_intention_title": "نیت:",
  "tmain_p5_intention_text": "من طواف عمره مفرده را انجام می‌دهم، قربةً الی‌الله",
  "tmain_p5_notice_text": "طواف قبل از شروط چهارم وضو از بین برده طواف باطل می‌شود\nبعد از اتمام شروط چهارم وضو از بین برده اشکالی ندارد",
  "tmain_p5_more_info": "اطلاعات بیشتر",
  "tmail_p6_title": "شمارش اشواط",
  "tmail_p6_text_item1": "وضو با غسل از بین رفت",
  "tmail_p6_text_item2": "نجس شدن لباس یا بدن تا عامدانه نباشد هنگام طواف",
  "tmail_p6_text_item3": "ستر عورت از بین رفت",
  "tmail_p6_text_item4": "بخشی از زیبایی‌های زن – مانند مو – ظاهر شد",
  "tmail_p6_text_item5": "شکایت",
  "tmain_p6_q1": "آیا توانایی برطرف کردن نجاست را بدون برهم زدن مسیر می‌تواند انجام دهد؟\nحتی اگر مجبور باشد لباس را تعویض کند یا لباسی پاک بپوشد؟",
  "tmain_p6_q1_hint": "پس از برطرف کردن نجاست طواف کامل کند",
  "tmain_p6_q2": "در صورت ناممکن بودن، با علم به نجاست یا طواف نجاست قبل از اتمام شوط رابع بوده؟",
  "tmain_p6_q2_hint1": "طواف را تمام کند و نیازی به اعاده آن نیست",
  "tmain_p6_q2_hint2": "یعنی نجاست بعد از شوط رابع بوده، طواف را تمام کند و نیازی به اعاده آن نیست",
  "tmain_p10_title": "احکام بطلان وضو",
  "tmain_p8_male_text": "اگر عورت مرد آشکار شد . لازم است بنا بر احتیاط واجب  آن مقدار از طواف را که در حتال برهنه شدن واقع شده است جبران کند",
  "tmain_p8_female_text": "بخشی از بدن زن که پوشنادن آن واجب است . به طور قهری یا از روی سهو آشکار شد طواف باطل نمیشود مگر آن مقداری که بدون رعایت شرایط انجام شده است پس اگر آن مقدار یک شوط یا بیشتر باشد آن شوط باطل میشود و باید دوباره انجام شود . و اگر بخشی از یک شوط باشد باید بزرگردد و همان مقدار را که در آن پوشش را رعایت نکرده بود جبران کند و اگر به سبب شدت ازدحام نتواند بازگردد میتواند بدون قصد طاف تا حچر السود راه برود سپس از آن شوط را از سر بگیرد ",
  "tmain_p9_text": "‫طواف‬‫ صحیح‬ ‫است‬",
  "tmain_p9_warning": "‫اما ‬‫موھای‬ ‫بود‬ ‫را‬ ‫بپوشاند‬",
  "tmain_p10_q1": "وضوی شما از بین رفته است؟",
  "tmain_p10_q1_option1": "بعد از اتمام شوط چهارم",
  "tmain_p10_q1_option2": "قبل از اتمام شوط چهارم",
  "tmain_p10_q1_hint": "طواف باطل است بعد از تجدید طهارت طواف را از نوع شروع کنید. اگر شخص جنب باشد واچب است فورا مسجد را ترک کند.",
  "tmain_p13_doubt1": "شک با ظن در عدد شوط‌ها",
  "tmain_p13_doubt2": "شک در طهارت در اثنای طواف",
  "tmain_p13_doubt3": "شک در فوت موالات عرفیه",
  "tmain_p13_doubt1_text1": "شک بین شوط 7 و شوط 8",
  "tmain_p13_doubt1_text2": "(جواب در باب بعد) طواف باطل است و بنا بر احتیاط واجب باید هفت شوط دیگر بجا آورد و بعد نماز طواف ادا کند و سپس طواف را از نو بجا آورد سپس وظیفه بعدی، نماز را بجا بیاورد",
  "tmain_p13_doubt1_text3": "در شک‌های زیر طواف باطل است بنا بر احتیاط واجب:",
  "tmain_p13_doubt1_text4": "شک بین شوط 3 و شوط 4\r\nشک بین شوط 3 و شوط 5\r\nشک بین شوط 3 و شوط 6\r\nشک بین شوط 3 و شوط 7\r\nشک بین شوط 4 و شوط 5\r\nشک بین شوط 4 و شوط 6\r\nشک بین شوط 4 و شوط 7\r\nشک بین شوط 5 و شوط 6\r\nشک بین شوط 5 و شوط 7\r\nشک بین شوط 6 و شوط 7",
  "tmain_p13_doubt1_q1": "آیا یقین به طهارت سابقه دارید؟",
  "tmain_p13_doubt1_q1_hint": "به شک خود اعتنا نکنید",
  "tmain_p13_doubt1_q2": "آیا شک قبل از اتمام شوط چهارم بوده؟",
  "tmain_p13_doubt1_q2_hint_yes": "تجدید وضو کرده طواف را از نو شروع کنید",
  "tmain_p13_doubt1_q2_hint2_no": "تجدید طهارت کنید و همان جا طواف را ادامه دهید و کامل کنید",
  "tmain_p13_doubt3_text1": "واجب است طواف را از سر انجام دهد",
  "tmain_p10_q2": "آیا شکستن طهارت قبلی با اختیار بوده؟",
  "tmain_p10_q2_hint1": "(در صورت بله) طواف را قطع کرده تجدید طهارت کنید؛ بعد از آن،\nاگر موالات از بین نرفته، طواف را از نو شروع کنید. اگر شخص جنب باشد، واجب است فوراً مسجد را ترک کند.\n\nاگر موالات از بین رفته، بنا بر احتیاط، باید طواف را قطع کرده تجدید طهارت کنید و دوباره طواف را کامل کنید و سپس نماز طواف را بخوانید. اگر تا کنون دوباره طواف و نماز را نخوانده، اگر شخص جنب باشد، واجب است فوراً مسجد را ترک کند.",
  "tmain_p10_q2_hint2": "اگر موالات از بین نرفته، طواف را از نو شروع کنید. اگر شخص جنب باشد، واجب است فوراً مسجد را ترک کند.\n\nاگر موالات از بین رفته، باید طواف را قطع کرده تجدید طهارت کنید و دوباره طواف را کامل کنید. اگر شخص جنب باشد، واجب است فوراً مسجد را ترک کند.",
  "tmain_p17_title": "طواف به پایان رسید",
  "tmain_p17_text1": "احتیاط واجب آن است که پس از طواف بیدرنگ\nنماز طواف خوانده شود؛ به این معنا که از نظر عرفی\nبین طواف و نماز فاصله‌ای ایجاد نشود.",
  "tmain_p17_text2": "و ظاهر این است که فاصله‌ای کوتاه، مانند ده دقیقه\nبرای استراحت یا یافتن جای بهتر و مناسب‌تر برای\nنماز و مانند این امور، با «مبادرت عرفی» منافاتی\nندارد.",
  "tmain_p17_text3": "همچنین او حق ندارد که قبل از نماز یک عمل\nمستقل دیگری مثلا نماز قضا یا نماز طواف نیابتی\nانجام دهد",
  "tmain_p18_title": "نیابت",
  "tmain_p18_text1": "کسی که نه می‌تواند مستقیم و نه مساعده\nطواف کند و نیز کسی دیگر هم نمی‌تواند\nاز طرف او طواف دهد، وظیفه او نائب گرفتن است",
  "tmain_p18_proxy_conditions": "شرائط نائب:",
  "tmain_p18_proxy_c1": "بالغ باشد، عاقل، مؤمن و قادر بر انجام عمل باشد",
  "tmain_p18_proxy_c2": "یقین حاصل شود که نائب عمل را انجام خواهد داد",
  "tmain_p18_proxy_c3": "صرف خبر دادن، بنا بر احتیاط واجب، کافی نیست",
  "tmain_p18_proxy_c4": "زن می‌تواند مرد شود و مرد نیز می‌تواند نائب زن گردد",
  "tmain_p18_proxy_c5": "عادل بودن نائب شرط نیست",
  "tmain_p18_proxy_c6": "نائب لازم نیست در حال احرام باشد",
  "tmain_p18_confirm_label": "نائب انجام داد",
  "tmain_p18_modal1_text1": "این گزینه فقط در این صورت انتخاب شود که:",
  "tmain_p18_modal1_text2": "اختیار متوقف کردن ویلچر در دست خود شما باشد.",
  "tmain_p18_modal1_text3": "طواف شما روی دیوار کعبه یا روی طبقهٔ آن (سطح بالاتر) انجام نشود.",
  "tmain_p18_modal1_q": "آیا وظیفه شما نیابت است یا نه؟",
  "tmain_p18_modal2_text1": "طواف شما روی دیوار کعبه یا روی طبقهٔ آن (سطح بالاتر) انجام نشود.",
  "tmain_p18_modal2_q": "آیا وظیفه شما نیابت است یا نه؟",
  "tmain_p19_title": "ویلچر و مانند آن",
  "tmain_p19_usecase_text1": "موارد استفاده از ویلچر:",
  "tmain_p19_usecase1": "اختیاری",
  "tmain_p19_usecase2": "اضطراری",
  "tmain_p19_q1": "آیا توانایی انجام طواف را خودتان دارید؟",
  "np0_text1": "برای نماز باید پشت مقام ابراهیم برود\nاحتیاط واجب آن است که پس از طواف بیدرنگ\nنماز طواف خوانده شود؛ به این معنا که از نظر عرفی\nبین طواف و نماز فاصله‌ای ایجاد نشود.",
  "np0_text2": "و ظاهر این است که فاصله‌ای کوتاه، مانند ده دقیقه\nبرای استراحت یا یافتن جای بهتر و مناسب‌تر برای\nنماز و مانند این امور، با «مبادرت عرفی» منافاتی\nندارد.",
  "np0_text3": "فاصله برای درک وقت فضیلت نماز واجب مشکل\nندارد\nفاصله برای شرکت در نماز جماعت مشکل ندارد\nفاصله برای ضرورت مانند تجدید طهارت مشکل\nندارد",
  "np0_text4": "همچنین او حق ندارد که قبل از نماز یک عمل\nمستقل دیگری مثلا نماز قضا یا نماز طواف نیابتی\nانجام دهد",
  "np0_q": "آیا قادر بر انجام نماز طواف هستید ولو با کمک\nدیگری؟",
  "np9_title": "نائب",
  "np9_text1": "وظیفه شما نائب گرفتن است",
  "np9_text2": "کسی می تواند نائب بگیرد که بدلیل بیماری شکستگی یا مانند آن، حتی با کمک دیگران نیز توانایی انجام مستقیم آن را ندارد",
  "np9_q": "آیا نائب با رعایت موالات عرفی نماز طواف را انجام\nداد؟",
  "np10_title": "حکم مسئله",
  "np10_text": "احتیاط واجب آن است که طواف را دوباره انجام دهد\nسپس برای نماز نائب بگیرد",
  "tpm1_item1": "من طهارت از حدث اکبر دارم(یعنی طهارت از جنابت یا مس میت)",
  "tpm1_item2": "من طهارت از حدث اصغر دارم",
  "tpm1_item3": "من طهارت بدن از خبث دارم",
  "tpm1_item4": "حتی خون کمتر از درهم هم معاف نیست",
  "tpm1_item5": "من طهارت لباس از خبث دارم",
  "tpm1_item6": "من ختنه شده هستم",
  "tpm1_item7": "حدودی از بدن که در نماز پوشاندن آن معتبر است را پوشانده‌ام",
  "tpm2_title": "طهارت از حدث اکبر",
  "tpm2_q1": "آیا می‌توانید غسل را انجام دهید؟",
  "tpm2_q1_hint_yes": "غسل انجام دهید و سپس طواف کنید",
  "tpm2_q2": "آیا از انجام غسل ناتوانید همراه با ناامیدی از توانایی انجام آن؟",
  "tpm2_q2_hint_no": "منتظر زوال عذر باشید",
  "tpm2_q3": "تیمم ممکن است؟",
  "tpm2_q3_hint_yes": "تیمم کنید و طواف انجام دهید. و احتیاط مستحب آن است که نائب بگیرید",
  "tpm2_q3_hint_no": "نائب بگیرید",
  "tpm2_confirm": "طهارت حاصل شد",
  "tpm3_title": "طهارت از حدث اصغر",
  "tpm3_status": "وضعیت:",
  "tpm3_status_healthy": "سالم",
  "tpm3_status_excused": "معذور",
  "tpm3_status_healthy_hint": "باید برای طواف وضو انجام دهید",
  "tpm3_status_healthy_hint2": "به خاطر عذری قادر به انجام وضو نیستم",
  "tpm4_title": "وظیفه معذور در وضو",
  "tpm4_q1": "اگر به خاطر عذری نمی‌توانید وضو بگیرید، آیا این عذر همراه با یأس و ناامیدی است؟",
  "tpm4_q1_hint_no": "منتظر زوال عذر باشید و وضو بگیرید و طواف انجام دهید.",
  "tpm5_title": "معذور",
  "tpm5_text1": "معذور مثل مجروح (مصداق معین شود)،\nمسلول و مبطون\n\nوظیفه اینان: طهارت عذریه",
  "tpm5_text2": "این که زمانی را بیابد که بتواند در آن مدت طواف را در حال طهارت انجام دهد، هرچند تنها به واجبات آن اکتفا کند.",
  "tpm5_text2_modal": "انتظار برای فرصت واجب است و تأخیر در آن لازم نمی‌باشد، چه فرصت در میانه وقت باشد یا در پایان آن.\n\nبله، اگر در انتظار آخر وقت باشد و در اثنای آن پیدا شود و او نماز خود را در آن زمان بخواند، طوافش در صورتی که به وظیفه خود عمل کرده (گرچه با تأخیر گناه کرده است) صحیح است.",
  "tpm5_text3": "این که اصلاً فرصتی برای طهارت و انجام طواف پیدا نکند یا فرصتی بسیار کوتاه داشته باشد که برای طهارت و بخشی از طواف کافی نباشد.",
  "tpm5_text3_modal": "وضو می‌گیرد ـ یا غسل می‌کند یا تیمم ـ بر حسب تکلیف خود و به آن اکتفا می‌کند.\nسپس طواف را انجام می‌دهد و به انجام آن اکتفا می‌کند و از آن خارج می‌شود، چه پیش از طواف و چه در اثنای آن اغماء کند.\nو همچنین در طهارت است، مگر آن‌که حدّی غیر از همان حدّی که گرفتار آن است از او سر بزند، یا همین حدّی که مبتلا به آن است شدیدتر شود، در صورتی که مستند به بیماری نباشد، هرچند بهبودی کامل باشد.",
  "tpm5_text4": "این که فرصتی داشته باشد که برای طهارت و بخشی از طواف کافی باشد.",
  "tpm5_text4_modal": "و احتیاط واجب آن است که طهارت حاصل کند و طواف را در زمان فرصت انجام دهد،\n\nاما اگر در هنگام طواف یا پس از آن ناگهان حدث بر او عارض شود، تجدید طهارت واجب نیست؛ مگر آن‌که حدث دیگری از او سر زند، طبق تفصیلی که در حالت دوم گذشت.\n\nو احتیاط مستحب، به‌ویژه برای کسی که مبتلا به اسهال مزمن (مبطون) است، آن است که هرگاه در هنگام طواف حدث ناگهانی بر او عارض شود، طهارت را تجدید کند و بر همان طواف ادامه دهد، مگر آن‌که تکرار این کار زیاد باشد به‌گونه‌ای که عرفاً مشقت محسوب شود؛\n\nیا به علت طول کشیدن زمان خروج ناگهانی حدث، یا طول کشیدن تجدید طهارت، یا هر دو با هم، موالات (پیوستگی) معتبر بین شوط‌های طواف از بین برود.",
  "tpm5_text5": "اگر احتمال دهد که زمانی پیدا شود که بتواند طواف را در حال طهارت به‌جا آورد.",
  "tpm5_text5_modal": "واجب نیست که آن را به تأخیر بیندازد تا وضعیت روشن شود؛\nبله، اگر شتاب کرد و آن را انجام داد و سپس آشکار شد که فرصت داشته است، بنا بر احتیاط واجب باید آن را دوباره انجام دهد.",
  "tpm5_text6": "اگر باور داشته که (هیچ‌گونه) فرصتی وجود ندارد، سپس خلاف آن آشکار شود.",
  "tpm5_text6_modal": "اگر (سه طواف) شتاب کرد و آن را انجام داد، و سپس روشن شد که فرصت وجود داشته است، بنا بر احتیاط واجب باید آن را دوباره انجام دهد.",
  "tpm5_modal_general_text": "و برای شخص مبطون (مبتلا به اسهال مزمن) احتیاط مستحب، بنا بر احتیاط لازم (به سیاق مسئله)، آن است که اگر توانایی دارد، بین دو کار جمع کند:\n\nهم خودش طواف و دو رکعت نماز آن را انجام دهد، و هم برای آنها نائب بگیرد.\n\nو اگر عذر او پس از انجام طواف با طهارت عذریه، قبل از پایان وقت طواف برطرف شود، اعاده طواف با طهارت اختیاری واجب نیست.",
  "tpm6_title": "راهنمایی ستر",
  "tpm6_general_text1": "در حالت طواف، پوشاندن عورت به همان حدودی که در نماز معتبر است، اینجا نیز معتبر می‌باشد (بنا بر احتیاط واجب).",
  "tpm6_general_text2": "و احتیاط آن است که همه شرایط لباس نمازگزار، در لباس طواف‌کننده نیز رعایت شود.",
  "tpm6_male_text": "اگر عورت مرد در هنگام طواف آشکار شود، بنا بر احتیاط لازم باید مقدار طواف را که در هنگام آشکار بودن انجام شده، دوباره جبران کند.",
  "tpm6_female_momayez_text": "احتیاط آن است که حدود پوشش نماز را رعایت کند؛ پس غیر از سر، گردن، دست‌ها و پاها، باقی بدن را بپوشاند.",
  "tpm6_female_text1": "در صحت طواف زن، پوشاندن پا لازم نیست؛ اما از جهت اینکه در معرض دید مردان نامحرم است، پوشاندن آن واجب می‌باشد.",
  "tpm6_female_text2": "نمایان شدن برخی از زیبایی‌های زن مانند مقدار کمی از موی سر در هنگام طواف، ضرری به طواف نمی‌زند؛ اما صحت طواف زن در صورتی که بازوانش یا تمام و یا بیشتر موی سرش آشکار باشد، محل اشکال است؛ حتی اگر از روی جهل باشد.",
  "tpm6_female_text3": "نپوشاندن چهره، بنا بر احتیاط واجب، در صحت طواف معتبر است (یعنی پوشاندن صورت جایز نیست) و اگر از روی جهل قصوری باشد، طواف باطل نمی‌شود.",
  "tpm6_female_text4": "اگر بخشی از بدن زن که پوشاندن آن واجب است، در حال طواف ولو قهری، مانند اینکه پوشش آشکار شود، پوشانده نشود و حتی یک شوط کامل یا بیشتر از آن در همان حالت انجام گیرد، طواف باطل نمی‌شود؛ زیرا آن مقدار که بدون رعایت ستر انجام شده است، محسوب نمی‌شود.",
  "tpm6_female_text5": "اگر زن بتواند بدون برگشتن، باید آن شوط را حذف کرده و از نو آن را انجام دهد؛ و اگر بخشی از آن شوط بوده، باید برگردد و همان مقدار را که بدون پوشش انجام شده، تدارک کند. و اگر به‌خاطر ازدحام امکان بازگشت نداشته باشد، می‌تواند بدون قصد طواف تا حجرالاسود قدم بزند و آن شوط را از نو آغاز کند.",
  "tpm6_female_text6": "اگر در اثنای طواف بخشی از زیبایی‌های زن ظاهر شود، این امر به طواف او ضرر نمی‌رساند.",
  "tpm6_confirm_text": "ستر حاصل شد",
  "tpm7_title": "چک لیست",
  "tpm7_text1": "طواف با نجاست بدن و لباس صحیح نیست، و خون کمتر از درهم هم معاف در نماز است.\nطواف بنا بر احتیاط واجب معاف نیست.\n\nهمچنین نجاستی که از آن در نماز معاف شده (لباس یا پوشش که شرط طواف نیست) نیز در طواف معاف نیست.\n\nاما حمل شیء متنجس در هنگام طواف در هر صورت اشکال ندارد.\n\nو نیز حمل شیئی که نجس عینی جایز است، همچنین حمل پوست حیوان که گوشت آن حلال نیست، و همچنین حمل کودک که او نجس است و عین نجاست وجود دارد، در حال طواف اشکال ندارد.",
  "tpm7_q1": "آیا مضطر هستید که با نجاست بدن یا لباس طواف کنید؟",
  "tpm7_q1_hint_yes": "اشکال ندارد.",
  "tpm7_q2": "نوع خباثت چیست ؟",
  "tpm7_q2_option1": "خون زخم‌ها یا جراحت‌های پیش از بهبودی",
  "tpm7_q2_option2": "غیر از آن",
  "tpm7_q2_option2_hint": "واجب است (بنا بر احتیاط واجب) نجاست را برطرف کنید.",
  "tpm7_q3": "آیا تطهیر یا تبدیل آن حرجی دارد؟",
  "tpm7_q3_hint_yes": "اشکال ندارد.",
  "tpm7_q3_hint_no": "واجب است (بنا بر احتیاط واجب) نجاست را برطرف کنید.",
  "tpm8_title": "چک لیست",
  "tpm8_text1": "ختان برای صبی غیر ممیز که ولیّ آن را طواف می‌دهد معتبر نیست بلکه احتیاط مستحب است",
  "tpm8_warning1": "اما صبی غیر ممیز که خودش طواف می‌کند معتبر است (حکم کامل شود با استفتا)",
  "tpm8_text2": "ختان واجب است، طواف شخص غیر مختون صحیح نیست",
  "tpm8_warning2": "اگر ختنه ممکن نباشد حکم را از آقای حیدر دریافت شود",
  "tpm8_submit_text": "",
  "tpm8_status1": "رجل",
  "tpm8_status2": "صبی ممیز (از 300)",
  "tpm8_status3": ""
}